pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
// Blue Mini STM32F103C8T6 High Density 20kB RAM 64kB Flash
// Timery TIM1,2,3,4 2xI2C 2xSPI 3xUSART
#define showInclude
#define showDefine		
#define DeclareFunction
#define showGlobalVariable	
#define fromRAM				//Program in RAM 	0x20000000

#ifdef showInclude
#include "inc/tool/delay.h"
#include <stdint.h>
#include <string.h>
#include <math.h>
#include "inc/stm32f10x.h"
#include "config.h"
#include "gpio.h"

#include "hdr/hdr_bitband.h"
#include "hdr/hdr_rcc.h"
#include "hdr/hdr_gpio.h"

#include "inc/tft/tft.h"
//#include "inc/tpad/touch.h"
//#include "inc/nrf24/nrf.h"

#include "inc/tool/UARTLib.h"
#include "inc/tool/sp_term.h"
//#include "inc/sdspi/matosd.h"
#include "inc/sdio/sdio.h"
#include "inc/spi/spi.h"
#include "inc/rtc/rtc.h"
#include "inc/flash/flash.h"
#include "inc/dht/dht.h"
#include "inc/opto/tsl2561.h"
#include "inc/spi/softspi.h"
#include "inc/lcd/uc1608.h"
#include "inc/sx1278/SX1278.h"
#include "inc/ssd1306/SSD1306.h"
#include "inc/ssd1306/Fonts.h"

//#include "inc/enc28j60/enc28j60.h"
//#include "inc/enc28j60/test_web_client.h" 
//#include "inc/enc28j60/ip_arp_udp_tcp.h"

#include "inc/i2c/i2c.h"

#endif
//typedef uint8_t u08; 
#ifdef showDefine
#define TC 										6

#define I2C_CR2_FREQ_36MHz		0b100100

#define TIMEZONE            	2
#define YEAR0               	1900
#define EPOCH_YR            	1970
#define SECS_DAY            	(24L * 60L * 60L)
#define LEAPYEAR(year)      	(!((year) % 4) && (((year) % 100) || !((year) % 400)))
#define YEARSIZE(year)      	(LEAPYEAR(year) ? 366 : 365)

#define MAX_DELAY   INT16_MAX       // 32767 usec Max

#endif
#ifdef showGlobalVariable

volatile uint32_t  trg0,trg1,trg2,trg3,trg4,trg5;
volatile int32_t   t3rg0,t3rg1,t3rg2,delay3_us;
volatile uint32_t  tim0,tim1,tim2,tim3,tim4,tim5,delay_us;
volatile uint32_t  Tim6,Time6,Timt,Timt3;


const int _ytab[2][12] ={
	{31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31},
	{31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}};

extern volatile char *U1buf_ptr;
volatile u32 	FLAG=0;					//bit define in config.h


T_RTC Rtc;
static T_SD1 	 TSpm;				// struktura pomiarowa
u08 *p_TSpm = (u08 *)&TSpm;	// wskaŸnik na strukture do odczytu z karty pamiêci

extern const uint16_t ASCII_1408[97][8];

//const u16 CRC_progmem __attribute__((section (".myBufSection"))) = 0xabab;

//volatile uint32_t Sec=0;

#endif
// local functions' declarations
#ifdef DeclareFunction
static void	flash_latency(uint32_t frequency);
static void SysInit(void);
static void pll_start(uint32_t crystal, uint32_t frequency);
static void rcc_init(void);
void 				SetDate(void);

u16 	torgb(u08 R,u08 G,u08 B);
void 				I2C2_init(void);
void 				I2C2_READ_REG( u08 adres, u08 reg_adres, u08 * dane, u08 len );
void				ReadNRF(void);
void 				WriteNRF(void);
void				Menu(void);
void 				nRFserver(void);
void 				MultiNRF(void);
void 				Receiver(void);
void 				OtherTest(void);

void io_pin_cfg(GPIO_TypeDef *port_ptr, int pin, int mode_cnf_value);

inline static void Usart1Init(void);
inline static void Usart2Init(void);
inline static void Tim2PWMInit(void);
inline static void Tim4Init(void);
inline static void Tim3Init(void);
inline static void ExtIInit(void);
inline static void ADC1Init(void);
inline static void ADC1DmaInit(void);
inline static void ADC1_DMA_Tim4_Init(void);
inline static void SysTickInit(void);
static void gmtime_r(const u32 *, struct tm *);
void nrf24con(void);
void TPDraw(void);
void Grfaphics(void);
void Console(void);
void ClockGraph(void);

uint32_t adc_get_internals(uint32_t avg_cycles);
void adc1_init_injected(uint32_t avg_cycles, uint32_t channels);
uint32_t adc_get_injected(uint32_t avg_cycles);
void Mem2MemDMAInit(void *src_buf, void *dst_buf);
void Mem2MemDMA(void *src_buf, u32 offset );
void Intro1(void);
void Intro2(void);	
void DACDmaInit(void);
void MemCard_Menu(void);
void Test_avg(void);
void Radio(void);
void CopyClock(char *dczas, T_RTC *Rtc);
void CopyTime(char *dczas, T_RTC *Rtc);				
void CopyDate(char *dczas, T_RTC *Rtc);				
void TPDraw(void);
void EN25QH64_Tool(void);
void ENC28J60_Tool(void);
void http_client(void);
void qtouch(void);
u32 qtouch_mesaure(void);
void data_logger(void);
void data_logger_chart( T_SD1 *,T_CHART_PARAM *,T_CHART_DATA *,u08 );
void data_looger_tool ( T_SD1 *sd,T_CHART_PARAM *chart,char *ch);
void data_looger_tool_menu( void);
void ramka(void);
void BMP280_spi(void);
void BMP280_i2c(void);
void TSL2561_i2c(void);

void MAX44009_i2c(void);
void SleepMode_(u08);
void lexmark_lcd(void);
void LoRaRX(void);
void LoRaTX(void);
void uv_meter(void);
void wiznet5500(void);

#endif
/*== INIT ===================================================================*/
void SysInit(void){
	pll_start(CRYSTAL, F_CPU);
#ifdef RAMCODE
	SCB->VTOR = NVIC_VectTab_RAM | (Offset & (uint32_t)0x1FFFFF80); //If in RAM
	//SCB->VTOR = NVIC_VectTab_RAM;
#endif
	SCB->CCR |= SCB_CCR_STKALIGN ;
	
	rcc_init();
	AFIO->MAPR = AFIO_MAPR_SWJ_CFG_1; // enable pin PA15=JTDI,PB3=JTDO,PB4=JNTRST,
	
	//SysTickInit();
	
	//==== ENABLE IRQ ==============================================================
	//Warninng !!! not use "NVIC_Enable..." before Init section 
	//NVIC_EnableIRQ(TIM7_IRQn);
	//NVIC_EnableIRQ(TIM2_IRQn);
	//NVIC_EnableIRQ(EXTI0_IRQn);			// Line 0
	//NVIC_EnableIRQ(EXTI1_IRQn);			// Line 1
	//NVIC_EnableIRQ(EXTI2_IRQn);			// Line 2
	//NVIC_EnableIRQ(EXTI3_IRQn);			// Line 3
	//NVIC_EnableIRQ(EXTI4_IRQn);			// Line 4
	//NVIC_EnableIRQ(EXTI9_5_IRQn);			// Line 5..9
	//NVIC_EnableIRQ(EXTI15_10_IRQn);	// Line 10..15
	//NVIC_EnableIRQ(RTC_IRQn);				// Real Time Clock Initail
	//NVIC_EnableIRQ(DMA1_Channel1_IRQn);				// DMA1 Channel1
}

/*== MAIN ===================================================================*/
void head(void){
		//Delay_ms(200);
		tr_pen_color( TGREEN );
	#ifdef RAMCODE
		UaPutK("\f\r\n Mini STM32F103C8T6 RAM   "); // Boot from RAM 	 = B0+ B1+
	#else
		UaPutK("\r\n Mini STM32F103C8T6 FLASH "); // Boot from FLASH = B0- B1+
	#endif
		uint2uart(F_CPU/1e6);	UaPutK(" MHz");
		tr_pen_color( TYELLOW );
	}

static u08 dma_buf[24];		

int main(void){
		
