pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
		SysInit();
		#define dly1 0xffffff
		
		// #define BLACK_Board
		#ifdef BLACK_Board
		 #define LED PB12_o
		 GPIOB->CRH = (GPIOB->CRH & 0xfff0ffff) | 0x00010000;	// LED Black PB12
		#else
		 #define LED PC13_o
		 GPIOC->CRH = (GPIOC->CRH & 0xff0fffff) | 0x00100000;	// LED Blue  PC13
		#endif
		
		/*
		uint16_t wart[16][16]; //tablica
		wart[5][5] = 15;
		uint16_t *BKPSRAMADDR0 = (uint16_t *)0x40024000UL;//wskaŸnik do pocz¹tku przestrzeni adresowej BACKUP SRAM
		*(BKPSRAMADDR0 + 5) = wart[5][5];
		BKPSRAMADDR0 				= &wart[5][5];
		//wart[licz1][licz2]= *(BKPSRAMADDR0 + licz3);
		*/
		
		Usart1Init(); // Green->PA10, White->PA9 
		head();
		
		//SleepMode(1);
		//uv_meter();
		//wiznet5500();		
		LoRaTX();
	}
	
/*== MAIN ===================================================================*/
#define wMOSI							bitband_t m_BITBAND_PERIPH(&GPIOA->ODR, 7)
#define wMISO							bitband_t m_BITBAND_PERIPH(&GPIOA->IDR, 6)
#define wSCK							bitband_t m_BITBAND_PERIPH(&GPIOA->ODR, 5)

uint8_t softSPI_w(uint8_t byte)	{
		uint8_t counter;
		for(counter = 8; counter; counter--)
		{
			if (byte & 0x80)			wMOSI = 1;
			else			wMOSI = 0;
			
			byte <<= 1;
			wSCK = 1; /* a slave latches input data bit */
			Delay_us(10);
			if (wMISO)			byte |= 0x01;
			
			wSCK = 0; /* a slave shifts out next output data bit */
			Delay_us(10);
		}
		return(byte);
	}

void wiznet5500(void){
	u16 AMh;
	s16 AMt;
	char strg[10];
	SPI1_init_();
	//GPIOA->CRL = (GPIOA->CRL & 0x000fffff) | 0x54500000;	// PA5~7
	GPIOB->CRL = (GPIOB->CRL & 0xffffff0f) | 0x00000010;	
	GPIOC->CRH = (GPIOC->CRH & 0xf0ffffff) | 0x01000000;	// LED Blue  PC14
	
	DHT_Init();
	ssd1306_init();
	//ssd1306_clear_screen(0xff);
	//ssd1306_display_string3216(0,32, (const u08*) unt2str(12345678, strg, 8));
	//ssd1306_refresh_gram();
	
	/*
	PB1_o = 1;
	PC14_o = 1;
	PC14_o = 0;	Delay_ms(2);	PC14_o = 1;
	Delay_ms(200);
	PB1_o = 0;
	
	softSPI_w(0x0);
	softSPI_w(0x0);
	softSPI_w(0x0);
	reg=softSPI_w(0x0); 
	*/ 
	
	//spi1_rw(0x0);
	//spi1_rw(0x1);
	//spi1_rw(0x0);
	//reg=spi1_rw(0x0);
	
	
	//UaPutK("\r\n W5500(1)=");
	//uint2uart(reg);
	//ssd1306_display_string    (0,0 , (const u08*)"Temp[C]   Hum[%]", 16, 1);
	//ssd1306_draw_point(0, 8, 1);
	u16 var=1;
	u08 tx[24]={0,1,2,3,4,5,6,7,8,9,8,4,6,8,10,12,14,15,13,12,11,10,9,8};
	//u08  tx[8]={0,1,2,3,4,5,6,7};
	u08 bar[8]={0x1,0x3,0x7,0xf,0x1f,0x3f,0x7f,0xff};
	
	for(u08 n=0;n<24;n++){
		//var = 1<<tx[n];
		//ssd1306_draw_byte(n,7,var>>8);
		//ssd1306_draw_byte(n,6,var&0xff);
		var = 1<<tx[n];
		if(var>255){ 
			ssd1306_draw_byte(n,7,bar[tx[n]]);
			ssd1306_draw_byte(n,6,bar[7]);
		}else{
			ssd1306_draw_byte(n,7,0);
			ssd1306_draw_byte(n,6,bar[tx[n]]);
		}
		
	} 
	
	//ssd1306_refresh_gram();
	

	
	while(1){
		
		if(STCLK_MS*1000  < (trg0 - SysTick->VAL)){
			trg0 = SysTick->VAL;
			
			if (!(DHT_read( &AMh, &AMt,1,&AM2302_pin)) ){		// AM2302 read T & H
			 	
			} 
			LED^=1;
			
			//ssd1306_display_string3216(0,32, (const u08*) unt2str(AMh, strg, 3));
			//ssd1306_display_string    (0,0 , (const u08*) int2str(AMt, strg, 3,1), 16, 1);
			//ssd1306_display_string    (45,0 , "C", 16, 1);
			
			//ssd1306_display_string    (0 ,16, (const u08*) int2str(AMh, strg, 3,1), 16, 1);
			//ssd1306_display_string    (45,16 , "%", 16, 1);
			ssd1306_display_string3216(0 ,32,(const u08*) unt2str(AMt, strg, 3));
			ssd1306_display_string3216(64,32,(const u08*) unt2str(AMh, strg, 3));
			if(flag_9)
			ssd1306_display_string3216(48,32,(const u08*) ";");
			else
			ssd1306_display_string3216(48,32,(const u08*) ":");
			flag_9 ^=1;
			
			ssd1306_refresh_gram();//
		}
	}
	
}
void uv_meter(void){
		
		u16 adc5,adc6;
		char strg[10];
		
		GPIOA->CRL = (GPIOA->CRL & 0x000fffff) | 0xaa000000; // ADC12_IN5		
		
		PB10_o = 1;
		LED = 1;
		I2C2_init();
		u08 a[256],b;
		//i2c2_scan(a,&b);
		
		
		ADC1Init();
		ADC1->SQR1 = ( 0<<20 	); 		//length and sequence 12..15 conversion 13-16 on channel	(0..17)
		ADC1->SQR3 = ( 5<<0*5 );		//(channel<<sequence*5) sequence=0..5   
		ADC1->SMPR2 = (4<<5*3 );
		ADC1->CR1 = ADC_CR1_SCAN;			// multi channel mode		
		ADC1->CR2 |= ADC_CR2_ADON ;		// On ADC
		
		ssd1306_init();
		ssd1306_clear_screen(0x00);
		//ssd1306_draw_point(10, 10, 0);
		u08 cnt=0;
		
		while(1){
			while(PB0_i==0);
			ssd1306_display_string3216(0,32, (const u08*) unt2str((cnt++)%20, strg, 2));
			ssd1306_refresh_gram();
			//i2c2_read( 0x21, 0x0, i2, 2 );
			i2c2_scan(a,&b);
			ssd1306_display_string3216(48,32, (const u08*) unt2str(b, strg, 2));
			ssd1306_refresh_gram();
			//if((cnt%10)==0)ssd1306_clear_screen(0xff);
			while(PB0_i==1);
			b=0;
		}
		
		while(1){ 
			for(u08 n=0;n<8;n++){
				ADC1_CR2_ADON = 1;							// start conversion ADC
				//Delay_200n(9);
				Delay_us(10);
				if(ADC1->DR>1180)	adc5 += ADC1->DR-1180 ;
			}
			adc5 /= 8;
			//ssd1306_display_string3216(0,16, (const u08*) uint2str(k++,strg));
			//ssd1306_display_string3216(0,0,(const u08*) unt2str(adc5, strg, 4));
			
			LED = 1;
			//i2c2_read( 0x10, 0x0, i2, 2 );
			LED = 0;
			
			//ssd1306_display_string3216(0,0, (const u08*) unt2str(adc5, strg, 4));
			ssd1306_display_string    (0,0,(const u08*) unt2str(adc5  , strg, 4),16,1);
			//ssd1306_display_string3216(0,32, (const u08*) unt2str(adc5, strg, 4));
			//ssd1306_display_string3216(0,32, (const u08*) unt2str(b, strg, 4));
			
			ssd1306_refresh_gram();
			Delay_ms(200);
			//ssd1306_init();
			//test();
			//ssd1306_refresh_gram();
			
		}
	}
void IRQLoraInit	(void)			{
		/*
			Library ST				 Manual RM0008
			AFIO->EXTICR[0] => AFIO_EXTICR1 GPIO 0..3			
			AFIO->EXTICR[1] => AFIO_EXTICR2 GPIO 4..7
			AFIO->EXTICR[2] => AFIO_EXTICR3 GPIO 8..11
			AFIO->EXTICR[3] => AFIO_EXTICR4 GPIO 12..15
			Jednoczeœnie pin moze byc skonfigurowany tylko dla jednego portu
		 */
		AFIO->EXTICR[0] = AFIO_EXTICR1_EXTI0_PB;		// Enable interrupt port PA0
		EXTI->PR   = EXTI_PR_PR0;			// Clear interupt request EXTI0
		EXTI->RTSR 	 = EXTI_RTSR_TR0;
		//EXTI->FTSR 			= EXTI_FTSR_TR6 | EXTI_FTSR_TR0;	// Failing trigger enabled
		EXTI->IMR  =  EXTI_IMR_MR0;		// Interrupt mask register EXTI_IMR
		NVIC_EnableIRQ(EXTI0_IRQn);			
	}
	


void LoRaRX(void){
		// SX1278, 16cm antena 433 MHz https://blog.domski.pl/stm32-hal-driver-for-lora-sx1278-wireless-module/
		char swh;
		u08 reg,dat;
		static SX1278_hw_t SX1278_hw1;
		static SX1278_t 	 SX1278_1;
		u16 Lp=0;
		
		 
		
		//Lora2 PA2=MOSI, PA1=MISO,PA0=SCK,PB8=CE,PB9=RST 
		/* // SPI Configured 
		GPIOB->CRH = (GPIOB->CRH & 0xffffff00) | 0x00000033;	//   
		GPIOA->CRL = (GPIOA->CRL & 0x00000000) | 0xBBB33343;	//   PA7=MOSI, PA6=MISO, PA5=SCK, PA4=CE PA3=Reset
		RX1276_RST1 = 1;
		RX1276_RST2 = 1;
		//GPIOC->CRH = (GPIOC->CRH & 0xfff0ffff) | 0x00010000;	// enc28_CS
		
		RCC->APB2ENR   |= RCC_APB2ENR_SPI1EN;
		SPI1->CR1 = SPI_CR1_SSM|SPI_CR1_SSI|SPI_CR1_MSTR|SPI_CR1_BR_0*7;	// 0x037c		
		SPI1->CR1 |= SPI_CR1_SPE;		
		*/
		//SX1278_hw_t SX1278_hw;
		//SX1278_t 		SX1278;
		p_Fifo1->rct=1;	p_Fifo1->rwi=1;	p_Fifo1->rbuf[0]='0';
		
		#ifdef NONE
		GPIOB->CRH = (GPIOB->CRH & 0xffffff00) | 0x00000043;	//   
		GPIOA->CRH = (GPIOA->CRH & 0x0ff00ff0) | 0x30034003;	
		
		SX1278_hw1.mosi = (u32 *)m_BITBAND_PERIPH(&GPIOA->ODR, 12); 
		SX1278_hw1.miso = (u32 *)m_BITBAND_PERIPH(&GPIOA->IDR, 11); 
		SX1278_hw1.sck  = (u32 *)m_BITBAND_PERIPH(&GPIOA->ODR,  8); 
		SX1278_hw1.nss  = (u32 *)m_BITBAND_PERIPH(&GPIOA->ODR, 15); 		
		SX1278_hw1.rst  = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 8); 
		SX1278_hw1.dio0 = (u32 *)m_BITBAND_PERIPH(&GPIOB->IDR, 9); 		
		
		SX1278_1.hw = &SX1278_hw1;			// wybor modulu
		SX1278_begin(&SX1278_1, SX1278_433MHZ, SX1278_POWER_11DBM, SX1278_LORA_SF_11,SX1278_LORA_BW_125KHZ);
		//SX1278_LoRaEntryRx(&SX1278_1, 64, 2000);
		#endif
		
