pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
		// RX
		GPIOB->CRH = (GPIOB->CRH & 0x0000ff00) | 0x43430033;	//   
		SX1278_hw1.mosi = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 12); 
		SX1278_hw1.miso = (u32 *)m_BITBAND_PERIPH(&GPIOB->IDR, 13); 
		SX1278_hw1.sck  = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 14); 
		SX1278_hw1.nss  = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 8); 
		SX1278_hw1.rst  = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 9); 
		SX1278_hw1.dio0 = (u32 *)m_BITBAND_PERIPH(&GPIOB->IDR, 15); 
		
		SX1278_1.hw = &SX1278_hw1;			// wybor modulu		
		SX1278_begin(&SX1278_1, SX1278_433MHZ, SX1278_POWER_11DBM, SX1278_LORA_SF_11,SX1278_LORA_BW_125KHZ);
		
		
		SX1278_LoRaEntryRx(&SX1278_1, 64, 2000);
		//IRQLoraInit();
		
		//SX1278_sleep(&SX1278);
		//SX1276Write(reg, 0x08);
		
		//UaPutK("\r\n Reg1 0x");		hex2uart(reg,2);
		//UaPutK("= 0x");					  
		//SX1278.hw = &SX1278_hw2;			
		//dat = SX1278_SPIRead(&SX1278, reg);
		//SX1276Read(reg, &dat);
		//hex2uart(dat,2);
		
		int 	message_length=65,ret;		
		static char 	buf_tx[256],buf_rx[256],str_num[12],buf2[10];
		s16 prssi,n=0;
		
		flag_9=0;
		
		strcpy (buf_tx, "RX_data ");
		strcat (buf_tx, uint2str(1000,str_num));
		
		
		u32 tim=tim;
		
		while(1){
			
			if(p_Fifo1->rct){
				UART_getChar( (char*)&swh);
				
				switch (swh)	{
					
					case 'q':
					//strBlock = UART_getNum();
					//*SX1278_hw1.nss = 0;
					UaPutK("\r\n");
					for (u08 n=0;n<0x14;n++){
						dat = SX1278_SPIRead(&SX1278_1, n);
						hex2uart(dat,2);
					}
					break;
					case 'r':
					//strBlock = UART_getNum();
					UaPutK("\r\n Read Reg1=0x");	reg=UART_getHex();
					UaPutK(" Reg1 0x");						hex2uart(reg,2);
					UaPutK("= 0x");	
					
					dat = SX1278_SPIRead(&SX1278_1, reg);
					hex2uart(dat,2);
					break;
					case 'l':
					UaPutK("\r\n message_length=");
					message_length = UART_getNum();					
					break;
					case 'b':
					UaPutK("\r\n pre_buf=");
					UART_getStr(buf2);					
					break;
					case 't':
					
					//strBlock = UART_getNum();
					UaPutK("\r\n Wprowadz tekst\r\n ");
					UART_getStr(buf_tx);
					message_length = strlen(buf_tx); 
					UaPutK("\r\n");	sint2uart(message_length);
					
					strcat (buf_tx, uint2str(message_length,str_num));
					
					//ret = SX1278_LoRaEntryRx(&SX1278_2, message_length, 1000);					
					UaPutK("\r\n Entry Rx status=");	hex2uart(ret,2);
					
					ret = SX1278_LoRaEntryTx(&SX1278_1, message_length, 1000);
					
					UaPutK("\r\n ret1=0x");			hex2uart(ret,1);
					ret = SX1278_LoRaTxPacket(&SX1278_1, (uint8_t *) buf_tx, message_length,4000);
					
					UaPutK("\r\n ret2=0x");			hex2uart(ret,1);
					
					break;
					default:
					break;
				}
				
				UaPutK("\r\n Menu > ");
				/*
				if(STCLK_MS*1000 < (trg0 - SysTick->VAL)){
				trg0 = SysTick->VAL;
				LX_RES = 0; Delay_us(10); LX_RES = 1;	// reset
				*/
			}
			
			// ================ Odbior RX ====================
			
			if( *SX1278_hw1.dio0 ){
				 message_length = SX1278_LoRaRxPacket(&SX1278_1);
				if(message_length){
					
					SX1278_read(&SX1278_1, (uint8_t *) buf_rx);
					UaPutK("\r\n RX-> ");
					UaPutS(buf_rx);
					//sint2uart(ret);
					//strcpy (buf_rx, "        ");
					//Delay_ms(100);				
					
					prssi = SX1278_SPIRead(&SX1278_1, LR_RegPktRssiValue)-164;
					//sint2str(rssi,str_num);
					//int2str(rssi ,str_num,3,0); UC1608_str (3, 0,str_num);
					//memcpy (UC1608_Buf,' ',150*8);
					LED ^= 1;
					UaPutK(" rssi=");
					sint2uart(prssi);
					UaPutK(" pkt_len=");
					sint2uart(message_length);
					//UaPutS(".");
			 	} 
			}
			// ================ Odbior RX ====================
			if(STCLK_MS*300 < (trg0 - SysTick->VAL)){	
				trg0  = SysTick->VAL;	
				
			}
		}
		
	}

void LoRaTX(void){
		// SX1278, 16cm antena 433 MHz https://blog.domski.pl/stm32-hal-driver-for-lora-sx1278-wireless-module/
		char swh;
		u08 reg,dat;
		static SX1278_hw_t SX1278_hw1;
		static SX1278_t 	 SX1278_1;
		u16 Lp=0;
		
		// Low power
		
		RtcInit();
		Tim3Init();
		
		p_Fifo1->rct=1;	p_Fifo1->rwi=1;	p_Fifo1->rbuf[0]='0';
		
		#ifdef NONE
		GPIOB->CRH = (GPIOB->CRH & 0xffffff00) | 0x00000043;	//   
		GPIOA->CRH = (GPIOA->CRH & 0x0ff00ff0) | 0x30034003;	
		
		SX1278_hw1.mosi = (u32 *)m_BITBAND_PERIPH(&GPIOA->ODR, 12); 
		SX1278_hw1.miso = (u32 *)m_BITBAND_PERIPH(&GPIOA->IDR, 11); 
		SX1278_hw1.sck  = (u32 *)m_BITBAND_PERIPH(&GPIOA->ODR,  8); 
		SX1278_hw1.nss  = (u32 *)m_BITBAND_PERIPH(&GPIOA->ODR, 15); 		
		SX1278_hw1.rst  = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 8); 
		SX1278_hw1.dio0 = (u32 *)m_BITBAND_PERIPH(&GPIOB->IDR, 9); 		
		
		SX1278_1.hw = &SX1278_hw1;			// wybor modulu
		SX1278_begin(&SX1278_1, SX1278_433MHZ, SX1278_POWER_11DBM, SX1278_LORA_SF_11,SX1278_LORA_BW_125KHZ);
		//SX1278_LoRaEntryRx(&SX1278_1, 64, 2000);
		#endif
		
		//TX
		GPIOA->CRL = (GPIOA->CRL & 0xfff00000) | 0x00044343;	//   PA2=MOSI, PA1=MISO, PA0=SCK, PB8=CE PB9=Reset
		GPIOB->CRH = (GPIOB->CRH & 0xffffff00) | 0x00000033;	//   
		SX1278_hw1.mosi = (u32 *)m_BITBAND_PERIPH(&GPIOA->ODR, 2); 
		SX1278_hw1.miso = (u32 *)m_BITBAND_PERIPH(&GPIOA->IDR, 1); 
		SX1278_hw1.sck  = (u32 *)m_BITBAND_PERIPH(&GPIOA->ODR, 0); 
		SX1278_hw1.nss  = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 8); 
		SX1278_hw1.rst  = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 9); 
		SX1278_hw1.dio0 = (u32 *)m_BITBAND_PERIPH(&GPIOB->IDR, 1); 
		
		SX1278_1.hw = &SX1278_hw1;			// wybor modulu		
		SX1278_begin(&SX1278_1, SX1278_433MHZ, SX1278_POWER_11DBM, SX1278_LORA_SF_11,SX1278_LORA_BW_125KHZ);
		
		int 	message_length=65,ret;		
		static char 	buf_tx[256],buf_rx[256],str_num[12];
		s16 prssi,n=0;
		u32 tim=tim,uxt,uxn;
		
		flag_9=0;		
		strcpy (buf_tx, "RX_data ");
		strcat (buf_tx, uint2str(1000,str_num));
		
		//trg1 = SysTick->VAL;
		LED	 = 1;
		
		strcpy (buf_tx," ");		
		strcat (buf_tx,unt2str(n++,str_num,5));
		strcat (buf_tx," ");
		SX1278_LoRaEntryTx (&SX1278_1, strlen(buf_tx), 2000);
		SX1278_LoRaTxPacketStart(&SX1278_1, (uint8_t *) buf_tx, message_length);  // Start transmisji
		flag_9=1;
		
		//GPIOA->CRL = (GPIOA->CRL & 0xfffff000)|0x00000222 ;
		GPIOA->CRH = (GPIOA->CRH & 0xfff0f0ff)|0x00020200 ; 
		//GPIOA->ODR = 0b0001010000000000;
		GPIOA->ODR |= (1<<10)|(1<<12); 
		
		//SleepMode(1);
		PWR->CR  |= (PWR_CR_LPDS | PWR_CR_CSBF | PWR_CR_CWUF);
		PWR->CR  &= ~PWR_CR_PDDS;   		
		SCB->SCR |=  SCB_SCR_SLEEPDEEP;		
		
		u32 alr;
		
