pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
		alr = ((RTC->CNTH<<16) | RTC->CNTL) + 2;
		
		while(!bRTC_CRL_RTOFF); 			//wait to synchro
		bRTC_CRL_CNF = 1;							//Start edit mode
		RTC->ALRH =  alr >>16;
		RTC->ALRL =  alr & 0xffff;
		//RTC->CRH  |= RTC_CRH_ALRIE; //Interrupt
		//RTC->CRL &= ~RTC_CRL_ALRF;
		bRTC_CRL_CNF = 0;					  	//End edit mode
		while(!bRTC_CRL_RTOFF); 	  	//wait to synchro
		 
		
		EXTI->PR   			= EXTI_PR_PR17;	
		EXTI->RTSR 	 		= EXTI_RTSR_TR17;
		//EXTI->IMR  			|= EXTI_IMR_MR17;		// Interrupt mask register EXTI_IMR
		EXTI->EMR  			= EXTI_EMR_MR17;		  // Event mask register EXTI_EMR
		//NVIC_EnableIRQ(RTCAlarm_IRQn);
		
		while(1){
			
			if(p_Fifo1->rct){
				UART_getChar( (char*)&swh);
				
				switch (swh)	{
					
					case 'q':
					//strBlock = UART_getNum();
					//*SX1278_hw1.nss = 0;
					UaPutK("\r\n");
					for (u08 n=0;n<0x14;n++){
						dat = SX1278_SPIRead(&SX1278_1, n);
						hex2uart(dat,2);
					}
					break;
					case 'r':
					//strBlock = UART_getNum();
					UaPutK("\r\n Read Reg1=0x");	reg=UART_getHex();
					UaPutK(" Reg1 0x");						hex2uart(reg,2);
					UaPutK("= 0x");	
					
					dat = SX1278_SPIRead(&SX1278_1, reg);
					hex2uart(dat,2);
					break;
					case 'l':
					UaPutK("\r\n message_length=");
					message_length = UART_getNum();					
					break;
					
					//strBlock = UART_getNum();
					UaPutK("\r\n Wprowadz tekst\r\n ");
					UART_getStr(buf_tx);
					message_length = strlen(buf_tx); 
					UaPutK("\r\n");	sint2uart(message_length);
					
					strcat (buf_tx, uint2str(message_length,str_num));
					
					//ret = SX1278_LoRaEntryRx(&SX1278_2, message_length, 1000);					
					UaPutK("\r\n Entry Rx status=");	hex2uart(ret,2);
					
					ret = SX1278_LoRaEntryTx(&SX1278_1, message_length, 1000);
					
					UaPutK("\r\n ret1=0x");			hex2uart(ret,1);
					ret = SX1278_LoRaTxPacket(&SX1278_1, (uint8_t *) buf_tx, message_length,4000);
					
					UaPutK("\r\n ret2=0x");			hex2uart(ret,1);
					
					break;
					default:
					break;
				}
				
				UaPutK("\r\n Menu > ");
				/*
				if(STCLK_MS*1000 < (trg0 - SysTick->VAL)){
				trg0 = SysTick->VAL;
				LX_RES = 0; Delay_us(10); LX_RES = 1;	// reset
				*/
			}
			
			// ================ Nadawanie TX =================
			
			#ifdef NONE
			//if(STCLK_MS*500 < (trg0 - SysTick->VAL) && flag_9==0){
			// trg0 = SysTick->VAL;
			if(TIM3_MS*500 < (t3rg0 - TIM3->CNT) && flag_9==0){
			 t3rg0 = TIM3->CNT;
				
				//UaPutK("\r\n TX...");	sint2uart(cnt);
				/*
				for(s=0;s<8;s++){
					buf_tx[s]='b';
				}
				buf_tx[s]=0; */
				
				strcpy (buf_tx," ");		
				//strcat (buf_tx,unt2str(tim/TIM_MS,str_num,7));
				strcat (buf_tx,unt2str(n++,str_num,5));
				strcat (buf_tx," ");
				message_length = strlen(buf_tx); 
				
				SX1278_LoRaEntryTx (&SX1278_1, message_length, 2000);
				
				TIM_start();
				// ==== Start transmisji ====
				SX1278_LoRaTxPacketStart(&SX1278_1, (uint8_t *) buf_tx, message_length);  // Start transmisji
				flag_9=1;
				
			}
			#endif
			// ==== Koniec transmisji ====
			/*
			if((*SX1278_hw1.dio0) && flag_9){
				
				SX1278_LoRaTxPacketEnd(&SX1278_1);
				flag_9=0;
				TIM_stop(&tim);
				//UaPutK("\r\n TX[ms]=");
				//uint2uart(tim/TIM_MS);
				//UaPutC(' ');
				//UaPutS(buf_tx);
				//UaPutC(' ');
				//uint2uart(message_length);
			} */
			
			// Obsluga z usypianiem
			if((*SX1278_hw1.dio0) && flag_9){
				
				SX1278_LoRaTxPacketEnd(&SX1278_1);
				flag_9=0;
				
				UaPutK("\r\n > ");
				TIM3_stop(&tim);
				UaPutK("Sleep ");
				uint2uart(tim/TIM3_MS);	UaPutK("[ms]");
				SX1278_sleep(&SX1278_1);
				
				//while(!bRTC_CRL_RTOFF); hex2uart(RTC->CRL,4);	  	//wait to synchro
				//uint2uart(tim/TIM3_US);	UaPutK("[us]");
				/* while(!bRTC_CRL_RTOFF); 	//wait to synchro
				bRTC_CRL_CNF = 1;					//Start edit mode
				RTC->CRL &= ~RTC_CRL_ALRF;
				bRTC_CRL_CNF = 0;					//End edit mode
				while(!bRTC_CRL_RTOFF); 	//wait to synchro
				*/
				Delay3_us(100);				
				
				__WFE();
				//__SEV();
				//__WFE();
				
				//__NOP();
				//__WFI();	
				__NOP();
				pll_start(CRYSTAL, F_CPU);
				
				uxt = (RTC->CNTH<<16) | RTC->CNTL;
				
				alr = ((RTC->CNTH<<16) | RTC->CNTL) + 9;				
				while(!bRTC_CRL_RTOFF); 	//wait to synchro
				bRTC_CRL_CNF = 1;					//Start edit mode
				RTC->ALRH =  alr >>16;
				RTC->ALRL =  alr & 0xffff;
				RTC->CRL &= ~RTC_CRL_ALRF;
				bRTC_CRL_CNF = 0;					//End edit mode
				while(!bRTC_CRL_RTOFF); 	//wait to synchro
				
				//EXTI->PR   			|= EXTI_PR_PR17;	
				//EXTI->RTSR 	 		|= EXTI_RTSR_TR17;
				//EXTI->FTSR 	 		= 0;
				//EXTI->EMR  			|= EXTI_EMR_MR17;		// Event mask register EXTI_EMR
				
				Delay3_ms(1);				
				
				UaPutK("... Wake-Up "); uint2uart(uxt);
				
				//while(!bRTC_CRL_RTOFF); hex2uart(RTC->CRL,4);	//wait to synchro
				
				SX1278_standby(&SX1278_1);
				Delay3_ms(1);
				SX1278_LoRaEntryTx (&SX1278_1, message_length, 2000);
				strcpy (buf_tx," ");		
				strcat (buf_tx,unt2str(n++,str_num,4));
				strcat (buf_tx," ");
				message_length = strlen(buf_tx); 
				TIM3_start();
				SX1278_LoRaTxPacketStart(&SX1278_1, (uint8_t *) buf_tx, message_length);  // Start transmisji
				
				flag_9=1;
				//LED	  =0;
				
			}
			// ================ Nadawanie TX =================
			//if(STCLK_MS*200 < (trg1 - SysTick->VAL) && flag_9==0){
			//trg1 = SysTick->VAL;
			if(TIM3_MS*2000 < (t3rg1 - TIM3->CNT)){
				t3rg1 = TIM3->CNT;
				//uxt = RTC->CNTL+(RTC->CNTH<<16);
				//uint2uart(uxt);
			}
			if(TIM3_MS*200 < (t3rg2 - TIM3->CNT)){
				t3rg2 = TIM3->CNT;
			}
		}
	}
void col1(void){
			dma_buf[0]=0xe0;	dma_buf[8]  =0xe0;	dma_buf[16]=0xe0;
			dma_buf[1]=0xe0;	dma_buf[9]  =0xe0;	dma_buf[17]=0xe0;
			dma_buf[2]=0xe0;	dma_buf[10] =0xe0;	dma_buf[18]=0xe0;
			dma_buf[3]=0xe0;	dma_buf[11] =0xe0;	dma_buf[19]=0xe0;
			dma_buf[4]=0xe0;	dma_buf[12] =0xe0;	dma_buf[20]=0xe0;
			dma_buf[5]=0xf8;	dma_buf[13] =0xe0;	dma_buf[21]=0xe0;
			dma_buf[6]=0xf8;	dma_buf[14] =0xe0;	dma_buf[22]=0xe0;
			dma_buf[7]=0xf8;	dma_buf[15] =0xe0;	dma_buf[23]=0xe0;
		}
void col2(void){
			dma_buf[0]=0xe0;	dma_buf[8]  =0xe0;	dma_buf[16]=0xe0;
			dma_buf[1]=0xe0;	dma_buf[9]  =0xe0;	dma_buf[17]=0xe0;
			dma_buf[2]=0xe0;	dma_buf[10] =0xe0;	dma_buf[18]=0xe0;
			dma_buf[3]=0xe0;	dma_buf[11] =0xe0;	dma_buf[19]=0xe0;
			dma_buf[4]=0xe0;	dma_buf[12] =0xe0;	dma_buf[20]=0xe0;
			dma_buf[5]=0xe0;	dma_buf[13] =0xe0;	dma_buf[21]=0xe0;
			dma_buf[6]=0xe0;	dma_buf[14] =0xe0;	dma_buf[22]=0xe0;
			dma_buf[7]=0xe0;	dma_buf[15] =0xe0;	dma_buf[23]=0xe0;
	}	
void col0(void){
			dma_buf[0]=0;	dma_buf[8]  =0x0;	dma_buf[16]=0x0;
			dma_buf[1]=0;	dma_buf[9]  =0x0;	dma_buf[17]=0x0;
			dma_buf[2]=0;	dma_buf[10] =0x0;	dma_buf[18]=0x0;
			dma_buf[3]=0;	dma_buf[11] =0x0;	dma_buf[19]=0x0;
			dma_buf[4]=0;	dma_buf[12] =0x0;	dma_buf[20]=0x0;
			dma_buf[5]=0;	dma_buf[13] =0x0;	dma_buf[21]=0x0;
			dma_buf[6]=0;	dma_buf[14] =0x0;	dma_buf[22]=0x0;
			dma_buf[7]=0;	dma_buf[15] =0x0;	dma_buf[23]=0x0;
	}
void ws2812led(void){
		
		//UaPutK("\f");
		//tr_cls(1);
		
		GPIOA->CRL = (GPIOA->CRL & 0x0000ffff) | 0xBBB30000;	// PA5~7
		
