pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
	}


u16  CalculateLux(u16 iGain, u16 tInt, u16 ch0, u16 ch1, int iType)	{
		//----------------------------------------------------------------------------
		// first, scale the channel values depending on the gain and integration time 16X, 402mS is nominal.
		// scale if integration time is NOT 402 msec
		
    u32 chScale;
    u32 channel1;
    u32 channel0;
     
    s32 ratio;
    u32 ratio1;
     
    u16 b, m;
     
    s32 temp;
     
    u32 lux;
     
    switch (tInt)
    {
      case 0: // 13.7 msec
       chScale = CHSCALE_TINT0;
      break;
      
      case 1: // 101 msec
       chScale = CHSCALE_TINT1;
      break;
      
      default: // assume no scaling
       chScale = (1 << CH_SCALE);
      break;
    }
		
    // scale if gain is NOT 16X
    if (!iGain) chScale = chScale << 4; // scale 1X to 16X
		
    // scale the channel values
    channel0 = (ch0 * chScale) >> CH_SCALE;
    channel1 = (ch1 * chScale) >> CH_SCALE;
//----------------------------------------------------------------------------

// find the ratio of the channel values (Channel1/Channel0)
// protect against divide by zero
    ratio1 = 0;
    if (channel0 != 0) ratio1 = (channel1 << (RATIO_SCALE+1)) / channel0;

// round the ratio value

    ratio = (ratio1 + 1) >> 1;

// is ratio <= eachBreak ?
    //u16 b, m;
    switch (iType)
    {
      case 0: // T, FN and CL package
        if ((ratio >= 0) && (ratio <= K1T))
           {b=B1T; m=M1T;}
            else if (ratio <= K2T)
                {b=B2T; m=M2T;}
            else if (ratio <= K3T)
                {b=B3T; m=M3T;}
            else if (ratio <= K4T)
                {b=B4T; m=M4T;}
            else if (ratio <= K5T)
                {b=B5T; m=M5T;}
            else if (ratio <= K6T)
                {b=B6T; m=M6T;}
            else if (ratio <= K7T)
            {   b=B7T; m=M7T;}
            else if (ratio > K8T)
                {b=B8T; m=M8T;}
            break;
			
       case 1:// CS package
            if ((ratio >= 0) && (ratio <= K1C))
            {b=B1C; m=M1C;}
            else if (ratio <= K2C)
            {b=B2C; m=M2C;}
            else if (ratio <= K3C)
            {b=B3C; m=M3C;}
            else if (ratio <= K4C)
            {b=B4C; m=M4C;}
            else if (ratio <= K5C)
            {b=B5C; m=M5C;}
            else if (ratio <= K6C)
            {b=B6C; m=M6C;}
            else if (ratio <= K7C)
            {b=B7C; m=M7C;}
            else if (ratio > K8C)
           {b=B8C; m=M8C;}
       break;
			
    }
		
    //u32 temp;
    temp = (u32)((channel0 * b) - (channel1 * m));
		
    // do not allow negative lux value
    if (temp < 0) temp = 0;
		
    // round lsb (2^(LUX_SCALE?1))
    temp += (1 << (LUX_SCALE-1));
		
    // strip off fractional portion
    lux = (u16)(temp >> LUX_SCALE);
		
    return(lux);
	}

void TSL2561_i2c(void){
		u08 buf[3];
		u32 tim;
		u16 ch0,ch1,lux=lux;
		
		#define TSL2561_ADR  0x72  // 0x72
		#define TIMING  0x81  
		#define DATA0LOW  0x8C 
		#define DATA0HIGH 0x8D 
		#define DATA1LOW  0x8E 
		#define DATA1HIGH 0x8F
		
		GPIOB->CRH = (GPIOB->CRH & 0xffff00ff) | 0x0000dd00;	// ...009900 PB11=SDA (Open-drain) PB10=SCL(Push-pull),
		
		RCC_APB1ENR_I2C2EN_bb = 1;         	// enable clock for I2C2 module
		I2C2_CR1_SWRST_bb = 1;            	// force software reset of I2C peripheral
		I2C2_CR1_SWRST_bb = 0;
		I2C2->TRISE = 37;               		// limit slope
		//I2C2->CCR = (1<<15) | (F_CPU/(4*400000));   // setup speed (400kHz)
		I2C2->CCR = (F_CPU/(4*400000));             // setup speed (100kHz)
		//I2C2->CCR = (1<<15) | (F_CPU/(4*100000));               			// setup speed (400kHz)
		//I2C2->CCR =  100;               			// setup speed (800kHz)
		I2C2->CR2 = I2C_CR2_FREQ_36MHz;     // config I2C2 module
		I2C2_CR1_PE_bb = 1;               	// enable peripheral
		/*
		i2c2_read(0xd0, 0x05, buf,1 );
		UaPutK("\r\n i2c_DS1207 = 0x");	
		hex2uart(buf[0],2);
		while(1);
		*/
		
		//UaPutK("\r\n  I2C ");	
		//hex2uart(GPIOB->CRH,8);
		
		buf[0]=0x80;
		buf[1]=0x03; 
		i2c2_write(TSL2561_ADR,buf,2); // init control Power UP
		buf[0]=0x81;
		buf[1]=0x02; 
		i2c2_write(TSL2561_ADR,buf,2); // init Timing 
		
		while(1){
			
			
			if(STCLK_MS*300 < (trg0 - SysTick->VAL)){
				trg0 = SysTick->VAL;
				//LED ^= 1;
				
				//i2c2_read(TSL2561_ADR, 0x8a, buf,1 ); // read id
				//hex2uart(buf[0],2);
				
				i2c2_read(TSL2561_ADR, DATA0LOW, buf,2 );
				ch0 = (buf[1]<<8)+buf[0];
				i2c2_read(TSL2561_ADR, DATA1LOW, buf,2 );
				ch1	= (buf[1]<<8)+buf[0];
				//hex2uart(ch0,4);
				//hex2uart(ch1,4);
				//hex2uart(buf[0],2);
				
				lux=CalculateLux(0,2,ch0,ch1,0);
				//UaPutK(" lux=");
				//hex2uart(lux,4);
				//sint2uart(lux);
				//UaPutK(" ");	
				sint2uart(ch0);
				UaPutK(",");	
				sint2uart(ch1);
				UaPutK("\r\n");	
				//printf("%d,%d\r\n",chan0,chan1) SerialPlot
				
				
				//UaPutK("\r\n  I2C ");	
				
				TIM_start();
				//Delay_us(10);
				TIM_stop(&tim);
				//UaPutS("tt="); sint2uart(tim);
				TIM_stop(&tim);
				//UaPutS(" tp="); sint2uart(tim/TIM_US);
				//BLED ^= 1;
			}	
		}
	}

#define MIN(a, b) (((a) < (b)) ? (a) : (b))
#define APDS9960_ADR 0x72  // 0x72

typedef enum {
    /* Acceptable parameters for setMode */
    POWER = 0,
    AMBIENT_LIGHT,
    PROXIMITY,
    WAIT,
    AMBIENT_LIGHT_INT,
    PROXIMITY_INT,
    GESTURE,
    ALL
	} ir_mode_t;

void set_mode( u08 mode, bool enable )	{
		u08 buf[3];
    /* Read current ENABLE register */
		i2c1_read(APDS9960_ADR, APDS9960_ENABLE, buf,1 );
		uint8_t reg_val = buf[0];
		
    if( reg_val == ERROR )
    return;
		
    mode = MIN( mode, ALL );
		
    if( mode == ALL )
    {
      reg_val = 0x00;
      if( enable )
      reg_val = 0x7F;
    } else {
      reg_val &= ~( 1 << mode );
      if( enable )
      reg_val |= ( 1 << mode );
    }
		
    /* Write value back to ENABLE register */
    
		buf[0]=APDS9960_ENABLE;			buf[1]=reg_val; 			i2c1_write(APDS9960_ADR,buf,2); 
	}

void MAX44009_i2c(void){
		u08 buf[10];
		u32 tim,exponent,mantissa,lux;
		u16 ch0,ch1,aR,aG,aB,aC;
		tim=tim;
		
		#define MAX44009_ADR 0x94  // 0x94
		#define TSL2561_ADR  0x72  // 0x72
		
		
