pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
		// =========================== I2C2 Init ==============================
		GPIOB->CRH    = (GPIOB->CRH & 0xffff00ff) | 0x0000dd00;	// PB11=SDA (Open-drain) PB10=SCL(Push-pull),
		RCC->APB1ENR |= RCC_APB1ENR_I2C2EN;
		//I2C2->CR1  |= I2C_CR1_SWRST;
		I2C2->TRISE   = 37;               								// limit slope
		//I2C2->CCR = (1<<15) | (F_CPU/(4*400000));   		// setup speed (400kHz)
		I2C2->CR2     = 0;
		I2C2->CCR     = (F_CPU/(4*400000));             	// setup speed (100kHz)
		//I2C2->CR2   = I2C_CR2_FREQ_36MHz;     					// config I2C2 module
		I2C2->CR1    |= I2C_CR1_PE;											  // I2C2 Pheripherial enable
		// =========================== I2C1 Init ==============================
		AFIO->MAPR   |= AFIO_MAPR_I2C1_REMAP;		// Remap TIM3 CH2->PB5
		GPIOB->CRH    = (GPIOB->CRH & 0xffffff00) | 0x000000dd;	// PB9=SDA (Alternate Open-drain) PB8=SCL(Alternate Open-drain),
		RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;
		I2C1->TRISE   = 37;               		// limit slope
		I2C1->CR2     = 0;
		I2C1->CCR     = (F_CPU/(4*400000));   // setup speed (400kHz)
		I2C1->CR1    |= I2C_CR1_PE;						// I2C2 Pheripherial enable
		
		/*
		i2c2_read(0xd0, 0x05, buf,1 );
		UaPutK("\r\n i2c_DS1207 = 0x");	
		hex2uart(buf[0],2);
		while(1);
		*/
		
		//UaPutK("\r\n  I2C ");	
		//hex2uart(GPIOB->CRH,8);
		//# Select configuration register, 0x02(02)
		//#       0x40(64)    Continuous mode, Integration time = 800 ms
		
		// TSL2561_Init
		buf[0]=0x80;
		buf[1]=0x03; 
		//i2c2_write(TSL2561_ADR,buf,2); // init control Power UP
		buf[0]=0x81;
		buf[1]=0x12; 
		//i2c2_write(TSL2561_ADR,buf,2); // init Timing 
		
		// MAX44009_Init
		buf[0]=0x02;
		buf[1]=0x40; 
		i2c2_write(MAX44009_ADR,buf,2); // init control Power UP
		
		/*
		buf[0]=APDS9960_ATIME;			buf[1]=DEFAULT_ATIME; 			i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=APDS9960_ATIME;			buf[1]=APDS9960_WTIME; 			i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=DEFAULT_PROX_PPULSE;	buf[1]=APDS9960_PPULSE; 		i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=DEFAULT_POFFSET_UR;	buf[1]=APDS9960_POFFSET_UR; i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=DEFAULT_POFFSET_DL;	buf[1]=APDS9960_POFFSET_DL; i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=DEFAULT_CONFIG1;			buf[1]=APDS9960_CONFIG1; 		i2c1_write(APDS9960_ADR,buf,2); 
    
		//ir_gesture_set_proximity_gain( DEFAULT_PGAIN );
    //ir_gesture_set_ambient_light_gain( DEFAULT_AGAIN );
		
		buf[0]=DEFAULT_PERS;				buf[1]=APDS9960_PERS; 		i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=DEFAULT_CONFIG2;			buf[1]=APDS9960_CONFIG2; 	i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=DEFAULT_CONFIG3;			buf[1]=APDS9960_CONFIG3; 	i2c1_write(APDS9960_ADR,buf,2); 
		*/
		
		set_mode( AMBIENT_LIGHT, true );
		//set_mode( POWER, true );
		
		i2c1_read(APDS9960_ADR, APDS9960_ID, buf,1 );
		UaPutK("\r\n APDS9960_ID=0x");	
		hex2uart(buf[0],2);
		
		Delay_ms(200);
		while(1){
			
			
			if(STCLK_MS*100 < (trg0 - SysTick->VAL)){
				trg0 = SysTick->VAL;
				//LED ^= 1;
				UaPutK("\r\n");	
				//i2c2_read(TSL2561_ADR, 0x8a, buf,1 ); // read id
				//hex2uart(buf[0],2);
				
				i2c2_read(MAX44009_ADR, 0x03, buf,2 );
				
				exponent = (buf[0] & 0xF0) >> 4;
				mantissa = ((buf[0] & 0x0F) << 4) | (buf[1] & 0x0F);
				//lux = (1<<exponent) * mantissa * 0.045; // printf("Ambient Light luminance : %.2f lux \n", luminance);
				lux = ((1<<exponent) * mantissa * 45 ) /1000 ;
				//lux = pow(2,exponent) * mantissa * 45;
				
				sint2uart(lux);
				UaPutK(",");	
				//num2uart(lux,7,0);
				i2c2_read(TSL2561_ADR, DATA0LOW, buf,2 );
				ch0 = (buf[1]<<8)+buf[0];
				i2c2_read(TSL2561_ADR, DATA1LOW, buf,2 );
				ch1	= (buf[1]<<8)+buf[0];
				
				lux=CalculateLux(1,2,ch0,ch1,0);
				sint2uart(lux);
				
				UaPutC(',');
				
				
				memset ( buf, 1, 10);
				i2c1_read(APDS9960_ADR, 0x94, buf,8 );
				aC = (buf[1]<<8)+buf[0];
				aR = (buf[3]<<8)+buf[2];
				aG = (buf[5]<<8)+buf[4];
				aB = (buf[7]<<8)+buf[6];
				
				sint2uart(aC); UaPutC(','); //hex2uart((buf[1]<<8)+buf[0],4);
				sint2uart(aR); UaPutC(','); //hex2uart((buf[3]<<8)+buf[2],4);
				sint2uart(aG); UaPutC(','); //hex2uart((buf[5]<<8)+buf[4],4);
				sint2uart(aB); UaPutC(',');//hex2uart((buf[7]<<8)+buf[6],4);
				
				
				//i2c1_read(APDS9960_ADR, 0x81, buf,1 );
				//hex2uart(buf[0],2);
				//hex2uart(ch0,4);
				//hex2uart(ch1,4);
				//hex2uart(buf[0],2);
				//printf("%d,%d\r\n",chan0,chan1) SerialPlot
				
			}	
		}
	}

 



void BMP280_i2c(void){
		u08 buf[24];
		u16 dig_T1,dig_P1;
		s16 dig_T2,dig_T3,dig_P2,dig_P3,dig_P4,dig_P5,dig_P6,dig_P7,dig_P8,dig_P9;
		u32 adc_T,var1,var2,t_fine,T,p,adc_P,tim;
		
		#define BMP280_ADR 0xEC
		GPIOB->CRH = (GPIOB->CRH & 0xffff00ff) | 0x0000bf00;	// ...009d00 PB10=SCL(Push-pull),PB11=SDA (Open-drain)
		
		RCC_APB1ENR_I2C2EN_bb = 1;         	// enable clock for I2C2 module
		I2C2_CR1_SWRST_bb = 1;            	// force software reset of I2C peripheral
		I2C2_CR1_SWRST_bb = 0;
		I2C2->TRISE = 37;               		// limit slope
		//I2C2->CCR = (1<<15) | (F_CPU/(4*400000));   // setup speed (400kHz)
		//I2C2->CCR = (F_CPU/(4*100000));             // setup speed (100kHz)
		I2C2->CCR = (1<<15) | 25;               			// setup speed (800kHz)
		I2C2->CR2 = I2C_CR2_FREQ_36MHz;     // config I2C2 module
		I2C2_CR1_PE_bb = 1;               	// enable peripheral
		
		i2c2_read(BMP280_ADR,  0xD0, buf,1 );
		UaPutK("\r\n i2c_BMP280 = 0x");	
		hex2uart(buf[0],2);
		
		// set oversampling and mode
		buf[0]=0xf4;
		buf[1]=0xb7; // 0xb3 0x27
		i2c2_write(BMP280_ADR,buf,2); // set mode
		// filter
		buf[0]=0xf5;
		buf[1]=0x10; // 0x27
		i2c2_write(BMP280_ADR,buf,2); // set mode
		
		i2c2_read(BMP280_ADR,  0x88, buf,6+16 );
		dig_T1 = (u16)(((u16)(buf[1]<<8)) | buf[0]);
		dig_T2 = (s16)((buf[3]<<8) | buf[2]);
		dig_T3 = (s16)((buf[5]<<8) | buf[4]);
		
		dig_P1 = (u16)(((u16)(buf[7]<<8)) | buf[6]);
		dig_P2 = (s16)((buf[9]<<8 ) | buf[8]);
		dig_P3 = (s16)((buf[11]<<8) | buf[10]);
		dig_P4 = (s16)((buf[13]<<8) | buf[12]);
		dig_P5 = (s16)((buf[15]<<8) | buf[14]);
		dig_P6 = (s16)((buf[17]<<8) | buf[16]);
		dig_P7 = (s16)((buf[19]<<8) | buf[18]);
		dig_P8 = (s16)((buf[21]<<8) | buf[20]);
		dig_P9 = (s16)((buf[23]<<8) | buf[22]);
		
