pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
		i2c2_read(BMP280_ADR,  0xf4, buf,1 ); hex2uart(buf[0],2);
		i2c2_read(BMP280_ADR,  0xf5, buf,1 ); hex2uart(buf[0],2);
		
		
		while(1){
			
			/*
			if(bit==0){
				pll_start(CRYSTAL, F_CPU);
				bit=1;
			} */
			
			if(STCLK_MS*500 < (trg0 - SysTick->VAL)){
				trg0 = SysTick->VAL;
				
				UaPutK("\r\n BMP280 ");	
				
				//buf[0]=0xf4;
				//buf[1]=0xb3; // 0xb3 0x27
				//i2c2_write(BMP280_ADR,buf,2); // set mode
				
				// Obliczenie temperatury ========================================================//
				i2c2_read(BMP280_ADR,  0xFA, buf,3 );
				
				TIM_start();
				
				adc_T = ( (u32)((u16)((buf[0]) << 8) | buf[1] ) << 4) | ( (buf[2]) >> 4);
				var1 = ((((adc_T>>3)  - ((s32)dig_T1<<1))) * ((s32)dig_T2)) >> 11;
        var2 = (((((adc_T>>4) - ((s32)dig_T1)) * ((adc_T>>4) - ((s32)dig_T1))) >> 12)
				* ((s32)dig_T3))>>14;
        
        t_fine = var1 + var2;
				//T     = (t_fine * 5 + 128) >> 8; // resolution 0.01 C
				//T     = (t_fine*25)/128 +5; 		 // resolution 0.001 C
				T     = (t_fine * 50 + 1280) >> 8; // resolution 0.001 C
				
				//Delay_us(10);
				TIM_stop(&tim);
				UaPutS("tt="); sint2uart(tim);
				
				//sint2uart(adc);
				UaPutK(" T=");	
				num2uart(T,5,3);
				
				// Obliczenie ciœnienia ==========================================================//
				
				i2c2_read(BMP280_ADR,  0xF7, buf,3 );				
				adc_P   = ((u32)((u16)(buf[0] << 8) | buf[1])<<4) | (buf[2]>>4);
				TIM_start();
				
				var1 = (((s32)t_fine)>>1) - 64000UL; 
				var2 = (((var1>>2) * (var1>>2)) >> 11 ) * ((s32)dig_P6); 
				var2 = var2 + ((var1*((s32)dig_P5))<<1); 
				var2 = (var2>>2)+(((s32)dig_P4)<<16); 
				var1 = (((dig_P3 * (((var1>>2) * (var1>>2)) >> 13 )) >> 3) + ((((s32)dig_P2) * var1)>>1))>>18; 
				var1 =((((32768+var1))*((s32)dig_P1))>>15); 
				if (var1 == 0) 
				{ 
					//return 0; // avoid exception caused by division by zero 
					break;
				} else { 
					p = (((u32)(((s32)1048576)-adc_P)-(var2>>12)))*3125; 
					if (p < 0x80000000) { p = (p << 1) / ((u32)var1); 	}  
					else  							{ p = (p 			 /  (u32)var1)*2; } 
					var1 = (((s32)dig_P9) * ((s32)(((p>>3) * (p>>3))>>13)))>>12; 
					var2 = (((s32)(p>>2)) * ((s32)dig_P8))>>13; 
					p = (u32)((s32)p + ((var1 + var2 + dig_P7) >> 4)); 
					p = (p*5)/8;
					p = (p*5)/8;
					UaPutK(" p= ");	
					num2uart(p,9,3);
				}
				
				TIM_stop(&tim);
				UaPutS(" tp="); sint2uart(tim/TIM_US);
				
				//LED ^= 1;
			}
			
			if( STCLK_MS*1000 < (trg1 - SysTick->VAL)){
				trg1 = SysTick->VAL;
			}
			
		}
	}
	
void BMP280_spi(void){
	// MASTER
		/*
		BMP280	I2C		SPI
		SCL  		SCL  	SCK			10k->Vcc
		SDA  		SDA  	MOSI		10k->Vcc
		CSB  		NC		CS			10k->Vcc
		SDO  		ADD  	MISO   	10k->GND
		*/
		GPIOA->CRL = (GPIOA->CRL&0x0000ffff)|0xB4B30000;	// PA4~7
		RCC->APB2ENR   |= RCC_APB2ENR_SPI1EN;
		//SPI1->CR1 = SPI_CR1_SSM|SPI_CR1_SSI|1<<3|SPI_CR1_MSTR;	
		//SPI1->CR1 = SPI_CR1_SSM|SPI_CR1_SSI|7<<3|SPI_CR1_MSTR|SPI_CR1_DFF;		
		SPI1->CR1 = SPI_CR1_SSM|SPI_CR1_SSI|7<<3|SPI_CR1_MSTR|SPI_CR1_CPOL|SPI_CR1_CPHA;		
		//SPI1->CR1 = 														 SPI_CR1_MSTR;		
		//SPI1->CR2 |= SPI_CR2_SSOE;		
		//SPI1->CR2  = 0;			
		SPI1->CR1 |= SPI_CR1_SPE;		
		
		trg0 = SysTick->VAL;		trg1 = SysTick->VAL;		trg2 = SysTick->VAL;
		
		u08 v0,v1;
		u08 value[3],ctrl_meas;
		u32 adc,var1,var2;
		
		u16 dig_T1;
		s16 dig_T2,dig_T3;
		u32 tFine,T;
		
		RX1276_CS1 = 0;
		
		spi1_rw(0xE0 & 0x7f);   // reset write
		spi1_rw(0xB6); 			    // reset value
		
		Delay_ms(10);
		
		spi1_rw(0xf4 & 0x7f); 	// Select Control register 
		spi1_rw(0x27); 					// Write  Control register 
		
		
		//spi1_rw(0); // Write  Control register 
		RX1276_CS1 = 1;
		
		
		while(1){
			
			
			if( STCLK_MS*2000 < (trg2 - SysTick->VAL)){
				trg2 = SysTick->VAL;
				//LED ^= 1;
				
				RX1276_CS1 = 0;
				
				spi1_rw(0xF4 & 0x7f); 	// Select Control register 
				spi1_rw(0x27); 					// Write  Control register 
				
				spi1_rw(0xF4);
				ctrl_meas = spi1_rw(0xff);
				
				spi1_rw(0x88);
				v0 = spi1_rw(0xff);
				v1 = spi1_rw(0xff);
				dig_T1 = (u16)(((u16)(v1<<8)) | v0);
				
				spi1_rw(0x8A);
				v0 = spi1_rw(0xff);
				v1 = spi1_rw(0xff);
				dig_T2 = (s16)((v1<<8) | v0);
				
				spi1_rw(0x8C);
				v0 = spi1_rw(0xff);
				v1 = spi1_rw(0xff);
				dig_T3 = (s16)((v1<<8) | v0);
				
				spi1_rw(0xFA);
				value[0] = spi1_rw(0xff);
				value[1] = spi1_rw(0xff);
				value[2] = spi1_rw(0xff);
				
				//spi_dat1 = spi1_rw(0xff);
				//spi_dat0 = spi1_rw(0x0);
				//==Init==//
				
				RX1276_CS1 = 1;
				
				UaPutK("\r\n BMP280T1 = 0x");	
				hex2uart(ctrl_meas,2);
				
				hex2uart(dig_T1,4);
				hex2uart(dig_T2,4);
				hex2uart(dig_T3,4);
				
				//hex2uart(spi_dat0,2);				
				//hex2uart(spi_dat1,2);
				//hex2uart(spi_dat2,2);
				
				
				adc = ( (u32)((u16)((value[0]) << 8) | value[1] ) << 4) | ( (value[2]) >> 4);
				//adc = (( (value[0] << 8) | value[1]) << 4) | ((value[2]) >> 4);
				//adc  =  (u32)(value[0]<<12) | (u16)(value[1]<<4) | (0x0f&(value[2]>>4)) ;
				var1 = ((((adc>>3) - ((s32)dig_T1<<1))) * ((s32)dig_T2)) >> 11;
        var2 = (((((adc>>4) - ((s32)dig_T1)) * ((adc>>4) - ((s32)dig_T1))) >> 12)
				* ((s32)dig_T3))>>14;
        //var2 = ((adc>>4) - ((int32_t)dig_T1));
        //var2 = (((var2 * var2) >> 12) * ((int32_t)dig_T3))>>14;
        tFine = var1 + var2;
				T     = (tFine * 5 + 128) >> 8;
				
				UaPutK(" T=");	
				sint2uart(adc);
				UaPutK(" ");	
				num2uart(T,5,3);
				//UaPutK(" Sleep ");	
				//__WFI();
				//__WFE();
			}
		}
		
	}

void fun_tool(u08 znak,T_SD1 * sda){
	u32 strBlock,tim;
	u08 buffer[512];
	u16 crc16;
	u08 *p_buf;
	static T_RTC datetime;
	*sda = *sda;


	switch(znak){
	//================================================================================
	case 'r':
		UaPutK("\r\n FLASH memory Read = ");
		UaPutK("\r\n FLASH memory Read = ");
		//UaPutK("\r\n sectorNumber =0x");
		strBlock = UART_getNum();
		
		//strBlock=UART_getHex();
		strBlock = strBlock > 254 ? 254 : strBlock;
		UaPutK("\r\n Flash memory Page ="); sint2uart(strBlock);
		strBlock = 0x800*strBlock + 0x08000000;
		//buffer = FLASH_PAGGE_122
		//p_buf = (u08 *) FLASH_PAGGE_120;
		//p_buf = (u08 *) W_FONT_1408;
		//p_buf = (u08 *) buffer;
		p_buf = (u08 *) strBlock;
		if(1){
			//if(disk_read (0,buffer,strBlock,1) == RES_OK ){
			UaPutS("\r\n ");
			
