pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
			hex2uart(strBlock, 8);
			for(u08 k=0;k<16;k++){
				hex2uart(k, 2);
			}
			
			UaPutS("\r\n\n ");
			for(u32 i=0;i<2048;i+=32){
				//hex2uart(strBlock*512 + i, 8);	// sd card
				hex2uart(strBlock + i, 8);	// memory
				for(u08 k=0;k<32;k++){
					hex2uart(p_buf[k+i], 2);
				}
				UaPutS("  ");
				for(u08 k=0;k<32;k++){
					if ( p_buf[k+i]<0x20 || p_buf[k+i]>127 ) UaPutC('.');
					else UaPutC(p_buf[k+i]);
				}
				UaPutS("\r\n ");
			}
			
			//*((u32*)p_buf+127) = 0;		// CRC obliczamy bez CRC
			//crc16_spi2((u16*)p_buf,sizeof(ASCII_1408_)/2, &crc16 );
			crc16_spi2((u16*)p_buf,2048, &crc16 );
			UaPutK(" crc = ");	hex2uart(crc16,4);
			
		} else UaPutK("\r\n Read Error !!!");
		break;
		//================================================================================
	case 'w':

		UaPutK("\r\n Flash memory Page = ");
		strBlock = UART_getNum();
		strBlock = strBlock > 254 ? 254 : strBlock;
		strBlock = (u32)(0x800*strBlock + 0x08000000);

		TIM_start();
		EraseFlashPage(strBlock);
		TIM_stop(&tim);
		UaPutS("\r\n Kasowanie pamieci FLASH = "); sint2uart(tim/TIM_US);
		//ProgramFlashFromAddr( (u32)strBlock,(u16*)ASCII_1408,776);
		//TIM_stop(&tim);
		//UaPutK("\r\n Czas zapisu do FLASH = "); sint2uart(tim/TIM_US);

		//sint2uart(sizeof(ASCII_1408_));


		break;
		//================================================================================
	case 'u':
		UaPutK("\r\n Godzina = ");
		datetime.hor = UART_getNum();
		UaPutK("\r\n Minut   = ");
		datetime.min = UART_getNum();
		UaPutK("\r\n Sekunda = ");
		datetime.sec = UART_getNum();

		datetime.yer=2016;	// 1970..2106
		datetime.mon=11;		// 1..12	miesi¹c
		datetime.mdy=18;		// 1..31	dzien miesiaca
		datetime.hor=10;		// 0..23	godzina 24h
		datetime.min=50;		// 0..59	minuta
		datetime.sec=30;		// 0..59	sekunda
		rtc_SetTime(&datetime );
		//UaPutS("\r\n uxt ="); sint2uart(utc);
		//utc = ((RTC->CNTL + (RTC->CNTH<<16)) - Off_TIME)%180;
		//UaPutS("\r\n uxt ="); sint2uart(utc);
		//rtc_GetTime(1, &rtc);

		break;
		//================================================================================
	case 'm' :
		UaPutS("\r\n Read Start !");
		for(u32 n=0;n<125;n++){
			TIM_start();
			//disk_read (0, p_sdbuf, (u32)n, 1);
			TIM_stop(&tim);
			tim = tim/TIM_US;
			//UaPutK("\r\n sd[ms] ");
			if(n%1000==0) UaPutK(".");
			if(tim>1000 || tim<700){ UaPutK("\r\n"); Int2uart(n,7,0); Int2uart(tim,6,3); }
		}
		UaPutS("\r\n Read Done !");
		break;
		//================================================================================
	case 'c' :
		TFT_Clear(BLACK);
		//ramka();
		UaPutS("\r\n Clear !");
		break;
		//================================================================================
	case 'o':
		UaPutK("Read sector");
		UaPutK("\r\n sectorNumber = ");
		//strBlock = UART_getNum((char *)uaBuf);
		u08 sd_status;
		strBlock=UART_getNum();
		TIM_start();
		//i=SD_readSingleBlock(buffer,strBlock);
		sd_status=mci_read_sect (strBlock,buffer,1);

		TIM_stop(&tim);
		if(sd_status){
			UaPutS("\r\n ");

			hex2uart(strBlock, 8);
			for(u08 k=0;k<16;k++){
				hex2uart(k, 2);
			}
			
			UaPutS("\r\n\n ");
			for(u32 i=0;i<512;i+=16){
				hex2uart(strBlock*512 + i, 8);
				for(u08 k=0;k<16;k++){
					hex2uart(buffer[k+i], 2);
				}
				UaPutS("  ");
				for(u08 k=0;k<16;k++){
					if ( buffer[k+i]<0x20 || buffer[k+i]>127 ) UaPutC('.');
					else UaPutC(buffer[k+i]);
				}
				UaPutS("\r\n ");
			}
			UaPutK(" t_rsdio = ");	uint2uart(tim/TIM_US);
			//TIM_start();
			crc16_spi2( (u16*) buffer,256, &crc16 );
			//TIM_stop(&tim);
			UaPutK(" crc = ");	hex2uart(crc16,4);
			//UaPutK(" t_crc = ");	uint2uart(tim/TIM_US);
		
		} else UaPutK("\r\n Read Error !!!");
		break;
		//================================================================================

		//================================================================================
	}
	UaPutS("\r\n ");
}

//=========================================================================================================
void data_logger(void)	{		// Odczytywanie danych z karty SD

	#define WID 0	// szerokosc lini wykresu
	//=======Punkty graniczne obszaru roboczego wykresu=========
	#undef wXmin 
	#define wXmin		31 				//31 			dolna granica wykresu X
	#undef wXmax 
	#define wXmax		(319-1)	  //319-1 	górna granica wykresu X
	
	#undef wYmin 
	#define wYmin		14 				//14 			dolna granica wykresu Y
	#undef wYmax 
	#define wYmax		(239-12) 	//240-13 	górna granica wykresu Y
	
	#undef wXlen
	#define wXlen		((wXmax)-(wXmin)+(1)) 	//szerokoœæ wykresu 
	
	#define VerB    (((wYmax)-(wYmin))/2)		// symetralna pionowa (Vertical Bisector)
	//#define HorB    ((wXlen)/2) 					// symetralna pozioma (Horizontal Bisector)
	#define HorB    (144*2) 								// symetralna pozioma (Horizontal Bisector)

	#define DATA_LOGGER_STIME 	1518670800ul 
	#define DLD 		1				// Co ile sekund pomiar							
	#define DLS 		1				// ile pomiarów na sekunde
	
	char chr;
	u08 dinit=0,kier=0;
	u32 tim=0,strB,hmt;
	u16 x=0,AMh;
	s16 AMt;
	tim=tim;
	//static volatile u16	dma_buf[4*(wXlen)];	
	static T_CHART_PARAM schp;	// parametry wykresu
	static T_CHART_DATA schd;	// dane wykresu
	static T_SD1 	 sda;		// struktura danych
	char tbuf[9]={"00:00:00"};
	char dbuf[11]={"0000-00-00"};
	char str[11];
	
	#define flg_sec			  		bitband_t m_BITBAND_PERIPH(&BKP->DR8,0)		//2sec interwal flag
	#define flg_refresh				bitband_t m_BITBAND_PERIPH(&BKP->DR8,1)		//refresh flag
	#define flg_chart_change 	bitband_t m_BITBAND_PERIPH(&BKP->DR8,2)		//Change chart  flag
	#define flg_chart_browse 	bitband_t m_BITBAND_PERIPH(&BKP->DR8,3)		//hm flag
	#define flg_wyb						bitband_t m_BITBAND_PERIPH(&BKP->DR8,4)		//choice flag
	#define flg_wr_data				bitband_t m_BITBAND_PERIPH(&BKP->DR8,5)		//
	#define flg_wr_usec				bitband_t m_BITBAND_PERIPH(&BKP->DR8,6)		//
	#define MSTAT		BKP->DR10
	
	
