pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
	ADC1Init();
	tim = tim/2;
	//ADC1DmaInit();
	RtcInit();
	crc16_spi2_init();
	dinit = mci_init();
	
	DHT_Init();

	if(dinit )
		UaPutK("\r\n SD Card Init OK");
	else {
		UaPutK("\r\n SD Card Init ERROR");
		TFT_txt("SD Card Init ERROR",100, 120,YELLOW);
	}
	rtc_GetTime(1,&Rtc);	
	ramka();

	//p_Fifo1->rct=1;	p_Fifo1->rwi=1;	p_Fifo1->rbuf[0]='a';
	// Parametry poczatkowe przetrzymywane w rejestrach zapasowych
	
	schp.hm= (BKP->DR2<<16) + BKP->DR1;	// przesuwanie poziome
	schp.vm= BKP->DR3;									// przesuwanie pior_dma_bufe
	schp.hs= BKP->DR4;									// skala pozioma
	schp.vs= BKP->DR5; 									// skala pionowa
	schp.sb= 1000;											// blok startowy z karty pamieci
	schp.hb= wXlen;										// blok startowy z karty pamieci
	
	// BKP->DR9 licznik zapisów na karte pamieci
	
	schp.sc=(1<<0)|(1<<1)|(1<<2)|(0<<3);	// który wykres wyœwietlaæ
	
	schp.cc[0]=YELLOW; schp.wd[0]=0; schp.ml[0]=1; schp.dv[0]=1; schp.dp[0]=0; schp.ad[0]= 0;
	schp.cc[1]=CYAN;	 schp.wd[1]=0; schp.ml[1]=1; schp.dv[1]=1; schp.dp[1]=1; schp.ad[1]= -200;
	schp.cc[2]=GREEN;	 schp.wd[2]=0; schp.ml[2]=1; schp.dv[2]=1; schp.dp[2]=1; schp.ad[2]= -200;
	schp.cc[3]=DGRAY;	 schp.wd[3]=0; schp.ml[3]=1; schp.dv[3]=2; schp.dp[3]=0; schp.ad[3]= 10;
	//sch.cc[3]=RED;		sch.wd[3]=0;
	//data_logger_chart(&sda,&schp,&schd,1);
	
	TFT_txt("Adc",0,14*1-2,schp.cc[0]);
	TFT_txt("Hum",0,14*3-2,schp.cc[1]);
	TFT_txt("Tem",0,14*5-2,schp.cc[2]);
	//================================================================================
	while(1){
		//if(0){
		if(p_Fifo1->rct){	// Wywolanie interfejsu szeregowego gdy odebrano znak
			UART_getChar(&chr);
				
				flg_chart_change = 1;
				
				switch (chr) {
				//======== Obsluga Menu wykresu ======================================
				case '8' : 	{ flg_chart_browse= 0; kier	= 0; }
					// ostatni blok jest pomiarowy					
				break;	// ON refresh;
				
				case '0' :  flg_wyb ^= 1; 	break;
				
				case '1' :  // Zmniejszanie poziome
					if(flg_wyb==0) { schp.hm += 1*schp.hs; flg_chart_browse=1 ; } 
					else  				 { schp.hs = schp.hs > 1 ? schp.hs-1 : 1;     }		// Skala pozioma hs
				break;
				
				case '3' : // Zwiekszanie poziome
					if(flg_wyb==0) { schp.hm -= 1*schp.hs; flg_chart_browse=1;   }	// Przesuwanie poziome
					else { 					 schp.hs  = schp.hs < 300 ? schp.hs+1 : 300; }
				break;
				
				case '5' :  // Zwiekszanie pionowe
					if(flg_wyb==0) { schp.vm += 1*schp.vs; } 
					else 					 { schp.vs = schp.vs > 1 ? schp.vs-1 : 1;  }		  // Skala pionowa
				break;
				
				case '2' :	// Zmniejszanie pionowe
					if(flg_wyb==0) { schp.vm -= 2*schp.vs; }	// Przesuwanie pionowe
					else 					 { schp.vs = schp.vs < 100 ? schp.vs+1 : 100; }
				break;
				
				case 'p':	// Zapisz biezace wyniki na karte 
					strB = DIMSDBLOCK*((hmt-schp.hb)/wXlen) + schp.sb;		// Blok zapis danych
					if(!mci_write_sect (strB,p_TSpm,DIMSDBLOCK)) 
					TFT_txt("Er0",0,6*14,RED); 
					
				break;
				
				case '4':	// reset skali
				schp.hs = 1;
				break;
				
				default: 
					data_looger_tool_menu();
					data_looger_tool( &sda, &schp, &chr);
					flg_chart_change = 0;
				break;	
				
			}
			
			if(flg_chart_browse)  schp.hb= wXlen/2; else schp.hb= wXlen;			
			
			BKP->DR1=schp.hm;	BKP->DR2=schp.hm>>16;
			BKP->DR3=schp.vm;
			BKP->DR4=schp.hs;
			BKP->DR5=schp.vs;
			
		}
		
		//================================================================================
		if(f3_rtc_1sec && flg_wr_usec==0){	
			trg0 = SysTick->VAL;
			
			flg_wr_usec = 1;
			
		}
		//================================================================================
		if( STCLK_MS*(100/DLS) < (trg0 - SysTick->VAL)){
			trg0 = SysTick->VAL;
			
			//flg_wr_data = 1;
			//flg_refresh = 1;
			//cusec = (cusec+1)%DLS;
			
			//ADC1->SR      = 0;						// nalezy wyzerowac caly rejestr ADC1->SR
			//ADC1_SR_EOC   = 0;
			
			ADC1_CR2_ADON = 1;							// start conversion ADC
			Delay_200n(9);
			TSpm.dat[0].d4 = (ADC1->DR/14) ;
			Delay_200n(9);
			TSpm.dat[0].d5 = (ADC1->DR/14) ;
			
			schp.hs = 1 + (TSpm.dat[0].d4*TSpm.dat[0].d4)/300 ;
			
			if(TSpm.dat[0].d6 != schp.hs){
				TSpm.dat[0].d6 = schp.hs;
				flg_chart_change = 1;
			}
			
			TFT_txt(int2str(TSpm.dat[0].d4,str,3,0)	,0,10*14,RGB(3, 3, 0)); 
			TFT_txt(int2str(TSpm.dat[0].d5,str,3,0)	,0,9*14	,RGB(3, 3, 0));  
			
			//TFT_txt(hex2str(tim				,str,8)		,50 ,229	,YELLOW); // 
			TFT_txt(int2str(schp.dv[1] 	,str,5,0)	,50 ,229	,YELLOW); // 
			
			//TFT_txt(int2str(AMh						,str,3,1)	,0,3*14	,RED);    // 
			//TFT_txt(int2str(AMt						,str,3,1)	,0,2*14	,GREEN); 
			
		}
		
		//================================================================================
		if(f3_rtc_1sec){	// Aktualizacja zegara
			f3_rtc_1sec = 0;
			
			rtc_GetTime(0,&Rtc);
			CopyTime(tbuf,&Rtc);
			
			if(((Rtc.sec+60*Rtc.min)%(schp.hs*DLD))==0){	flg_refresh = 1;	} // Odswierzanie wykresu
			if ((Rtc.sec%DLD                      )==0){	flg_wr_data = 1;	} // Zapis danych
			
			TFT_txt(tbuf,260,229,YELLOW);
			
			if(0){
				CopyDate(dbuf,&Rtc);
				TFT_txt(dbuf,0	,229,YELLOW);
			}
		}
		//================================================================================
		if(flg_wr_data ){	// pomiar co 5sek
			flg_wr_data = 0;
			
			///hmt = sch.hm+schp.hb*sch.hs + 1;
			
			hmt = ( ((RTC->CNTH<<16)|RTC->CNTL) - DATA_LOGGER_STIME)/DLD;
			x   =  hmt%wXlen;
			
			//if(Rtc.sec==0) { TSpm.dat[x].d3 = x; LED1 = 1;  }
			//else   				 { TSpm.dat[x].d3 = 0; LED1 = 0; }			
			
			/*
			ADC1_SR_EOC   = 0;
			ADC1->SR      = 0;							// nalezy wyzerowac caly rejestr ADC1->SR
			ADC1_CR2_ADON = 1;							// start conversion ADC
			TIM6_start();
			//while(!ADC1_SR_EOC);						// wait for the end of convertion			
			
			Delay_200n(10);
			TSpm.dat[x].d0 = (ADC1->DR/20) ;
			Delay_200n(10);
			TSpm.dat[x].d1 = (ADC1->DR/20) ;
			
			TIM6_stop(&tim);
			*/
			
			//if(x==0) TSpm.dat[x].d0 = 20; else  TSpm.dat[x].d0 = 0; 
			
