pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
			//TIM_start(); 
			if(!(DHT_read( &AMh, &AMt,1,&AM2302_pin)) ){		// AM2302 read T & H
				TSpm.dat[x].d1 = AMh;
				//TSpm.dat[x].d2 = AMt;
				TSpm.dat[x].d2 = AMt+200;
			}
			//TIM_stop(&tim); 
			//TFT_txt(hex2str(ADC1->SR,    str,4)	,60,229	,YELLOW); // 
			
			if(x==wXlen-1){
				
				strB = DIMSDBLOCK*((hmt)/wXlen) + schp.sb;		// Blok zapis danych
				TIM_start();
				if (mci_write_sect (strB,p_TSpm,DIMSDBLOCK)) 	{ LED2 ^= 1; 								 }
				else																					{	TFT_txt("Er0",0,6*14,RED); }
				TIM_stop(&tim);
			}			
			TFT_txt(int2str(x	,str,3,0)	,0,12*14	,YELLOW); // 
			
			
		}
		//================================================================================
		if(flg_refresh){	// odswierzanie wg. skali hs0
			flg_refresh=0;
			
			if(flg_chart_browse){				// odswierzaj
				kier=1; 									// wszystkie bloki z karty
				
			} else {
				///sch.hm += 1*sch.hs;		// przesun wykres
				schp.hm  = hmt ;					// przesuwaj wg. czasu
				flg_chart_change = 1;			// poka¿ wykres
				kier		= 0;							// ostatni blok jest pomiarowy					
			}
		}
		
		//================================================================================
		
		if(flg_chart_change){ 
			flg_chart_change = 0;
			data_logger_chart(&sda,&schp,&schd,kier);
			
		}
	}
}//================================================================================

void data_logger_chart( T_SD1 *sd, T_CHART_PARAM *chp, T_CHART_DATA *chd,u08 sw2){  // Rysowanie wykresu z karty SD
		s32 yn[4],yp[4],M,m,strBLK;		
		
		u16 x,n=0,nrys=0;
		s16 px=0;		
		T_SD1 *p_s  = sd;
		u08 *p_sd = (u08 *)sd;	// wskaŸnik na strukture do odczytu z karty pamiêci
		u08 last_p=0,f0=1;
		T_RTC lrtc;
		u32 uxt;
		
		char str[10],tbuf[9]={"00:00:00"};
		sw2=sw2;
		
		if(flg_chart_browse)
		TFT_Fill(wXmin+143,wYmin,wXmin+143,wYmax,DGRAY);	// rysuj symetraln¹ pionowa (Bisector)
		else
		TFT_Fill(wXmin+143,wYmin,wXmin+143,wYmax,BLACK);	// rysuj symetraln¹ pionowa (Bisector)
		
		M = chp->hm-(chp->hb)*(chp->hs);		  		//bezwzglêdny index danych 'M' dla x=0
		m = M%wXlen;															//wzglêdny index danych
		strBLK = DIMSDBLOCK*(M/wXlen) + chp->sb;	//blok do odczytu
		
		uxt = RTC->CNTL+(RTC->CNTH<<16);
		
		/*
		UaPutS("\f hm,\t vm,\t  hs,\t vs,\t M,\t m,  T_SD1 \r\n");
		UaPutS("");		sint2uart(chp->hm); UaPutS("\t"); sint2uart(chp->vm);
		UaPutS("\t"); sint2uart(chp->hs); UaPutS("\t"); sint2uart(chp->vs);	
		UaPutS("\t"); sint2uart(M);				UaPutS("\t"); sint2uart(m);
		UaPutS("\r\n");
		*/
		if(strBLK<0) return;
		
		/*if(mci_read_sect (strBLK,p_sd,DIMSDBLOCK))	// pierwszy odczyt pamieci masowej
		{ strBLK += DIMSDBLOCK; } */
		
		for(x=0;x<(wXlen);x++){
			if (1){								// warunek wejœcia w zakres prawid³owych danych
				
				if(1){												// odczyt z pamieci flash (nowe wartosci)
					yn[0]=0;	yn[1]=0;					// pierwsze zerowanie zmiennych 
					yn[2]=0;	yn[3]=0;					// pomocniczych	punktu nastêpnego
					//memset (yn,0,4*4);
					
					for(n=0;n<chp->hs;n++){		// obliczenie œredniej dla jednego punktu ================
						
						if((m+n)>(wXlen-1) || f0){	// Odczytaj SD gdy przekroczony zakres
							
							if(++last_p <= chp->hs || sw2==1){	//ostatni wykres
								if(mci_read_sect (strBLK,p_sd,DIMSDBLOCK)){
									strBLK += DIMSDBLOCK;
									///UaPutC('.');
								} else { UaPutS("\r\n Blad odczytu"); while(1); }
							}else {
							  p_s = &TSpm;	// Dla ostatniego przebiegu zmiana na strukture pomiarowa
								///UaPutC(',');
								
							}
							
							if(!f0) m = -n;
							
							//sint2uart(x);
							f0=0;
						}
						
						// sumowanie wynikow dla danej skali =====================================
						
						if(chp->sc & (1<<0)) yn[0] += p_s->dat[m+n].d0;
						if(chp->sc & (1<<1)) yn[1] += p_s->dat[m+n].d1;
						if(chp->sc & (1<<2)) yn[2] += p_s->dat[m+n].d2;
						if(chp->sc & (1<<3)) yn[3] += p_s->dat[m+n].d3;
						
					}
					m += chp->hs;
					
					for(u08 k=0;k<NChart;k++){			// wybierz wykresy do wyswietlania
						if(chp->sc & (1<<k)){					// Wybór wykresu
							
							
							// Wartosc w symetralnej
							if( x == chp->hb-1 ){
								chd->bv[k] = yn[k]/chp->hs ;
								//mid_scl = ((strBLK - chart->sb)/DIMSDBLOCK)*(wXmax-wXmin) + m + n/2;																
								//mc = m+n;
							} 
							yn[k]/= chp->hs;
							yn[k] = (chp->ml[k]*(yn[k] + chp->ad[k]))/chp->dv[k];	// obliczenie dla punktu
							yn[k] = wYmin + VerB + (chp->vm + yn[k])/chp->vs;     // Obl wsp. punktu wyswietlacza	
						}
					}
					chd->bv[2] -= 200;
					
				} else {	// odczyt z bufora (wartosci z wykresu)
					
					yn[0] = chd->bc[0][x+px];			
					yn[1] = chd->bc[1][x+px];			
					yn[2] = chd->bc[2][x+px];			
					yn[3] = chd->bc[3][x+px];			
				}
				// Obliczanie i rysowanie wykresów ======================================================================
				for(u08 k=0;k<NChart;k++){					// wybierz wykresy do wyswietlania
					if(chp->sc & (1<<k)){						// Wybór wykresu
						
						// Czysc poprzedni punkt
						if(x!=wXlen-1){
							TFT_dy (x+wXmin ,chd->bc[k][x] ,chd->bc[k][x+1] ,BLACK,chp->wd[k]); 												
						}
						
						if ((yn[k]+chp->wd[k]) > wYmax) yn[k]= wYmax;				// Ograniczenie górne
						if (yn[k] < wYmin) 							yn[k]= wYmin;				// Ograniczenie dolne
						
						//Rysuj punkt wykresu
						if(x!=0){
							TFT_dy (x-1+wXmin ,yp[k] ,yn[k] ,chp->cc[k],chp->wd[k]); 
							nrys++;
						}
						chd->bc[k][x] = yn[k];	// Zapisz wsp. punktu do bufora wykresu
						yp[k]					= yn[k];	// Zapisz wartoœæ poprzedni¹
					}
				}
			}
			//sint2uart(m);
			
		}
		// Wartosci liczbowe 
		
		for(u08 k=0;k<NChart;k++){							
			
			if(chp->sc & (1<<k))	TFT_txt(int2str (chd->bv[k],str,3 ,chp->dp[k]),0,14*k*2 ,chp->cc[k]);
		}
		
		TFT_txt(int2str(chp->hs ,str,3,0)	,0	,13*14	,YELLOW);	// Skala
		//TFT_txt(int2str(chart->hm		,str,4,0)	,0	,14+4*14 	,YELLOW);
		//TFT_txt(int2str(M						,str,5,0)	,0	,0 				,YELLOW);
		//TFT_txt(int2str(chart->hm,str,6,0)	,0,0				,YELLOW); // srodek skali
		
		if(flg_chart_browse==0) TFT_txt("ONL",0,15*14,RGB565CONVERT(255, 0, 0 )); 
		else 			 							TFT_txt("OFL",0,15*14,YELLOW); 
		if(flg_wyb==0) 					TFT_txt("MOV",0,15*13,YELLOW); 
		else 			 							TFT_txt("SCL",0,15*13,GREEN); 
		
		uxt=DLD*chp->hm + DATA_LOGGER_STIME-2;
		CopyTime(tbuf,rtc_unix2time(uxt, &lrtc)); 
		TFT_txt(tbuf,150,0,YELLOW); // czas w punkcie srodkowym
		
