pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
	}

void data_looger_tool_menu( void){
		UaPutK(" ================= Data Looger Tool ===============\r\n");
		UaPutK("  a - add data  r - Read  data  i - Import data    \r\n");
		UaPutK("  z - write raw w - Write data  s - reset & time	 \r\n");
		UaPutK(" ==================================================\r\n > ");
	}
void data_looger_tool( T_SD1 *sd,T_CHART_PARAM *chart, char *ch){
		char  chr=*ch ,sget[20],snum[8];
		u08 ws;
		u16 crc16,g;
		s16 b,f;
		u32 hm,avg,stB,strBlock,tim=0;
		static T_SD0	 sdb;			// Odczyt przez port szeregowy z innego urzadzenia
		
		//u32 
		//chart->hm
		
		
		u08 *p_sd  = (u08 *)sd; // 8bitowy wskaznik na tablice odczytu/zapisu karty pamieci
		//u16 *p_crc = (u16 *)sd;
		u08 *p_sdb = (u08 *)&sdb;
		
		switch (*ch) {
			case 'm':
				UaPutK("Przesuniecie =");
				uint2uart(chart->hm); UaPutC('/');
				hm = UART_getNum();
				if(hm){
					chart->hm=hm;
					BKP->DR1=chart->hm;	
					BKP->DR2=chart->hm>>16;
				}
			break;
			//======== Zapis testowych danych na krte SD ====================
			case 'r':
				UaPutK("\r\n Index HorBisector = ");
				hm=UART_getNum();
				strBlock = DIMSDBLOCK*(hm/1) + chart->sb;	// Blok odczytu
				b = hm%wXlen;
				
				UaPutK("\r\n Sector memory = ");
				sint2uart(strBlock);
				
				UaPutK("\r\n Time    \t d0   d1   d2   d3   d4   d5   d6   d7   d8   e0   e1\r\n\r\n");
				if(mci_read_sect (strBlock,p_sd,DIMSDBLOCK)){
					for (f=b-8>0?b-8:0;f<b+8 ;f++){
						
						num2uart(hm-b+f,8,0); 
						num2uart(f,4,0); UaPutK(" -");
						num2uart(sd->dat[f].d0,5,0); 
						num2uart(sd->dat[f].d1,5,0); 
						num2uart(sd->dat[f].d2,5,0); 
						num2uart(sd->dat[f].d3,5,0); 
						num2uart(sd->dat[f].d4,5,0); 
						num2uart(sd->dat[f].d5,5,0); 
						num2uart(sd->dat[f].d6,5,0); 
						num2uart(sd->dat[f].d7,5,0); 
						num2uart(sd->dat[f].d8,5,0); 
						num2uart(sd->dat[f].e0,5,0); 
						num2uart(sd->dat[f].e1,5,0); 
						UaPutK("\r\n");
					}
					//crc16_spi2(p_crc,DIMSDBLOCK*256, &crc16 );
					//UaPutK("\r\n crc2 ");	
					//uint2uart(2*DIMSDBLOCK*256);
					//UaPutK(" byte =");	
					//hex2uart(crc16,4);
				}
				strBlock += DIMSDBLOCK;
				
			break;
			case 'w': //Write data all
				
				UaPutK(" \r\n Podaj G_index  = ");		hm = UART_getNum();
				UaPutK(" \r\n wartosc        = ");		g  = UART_getNum();
				
				strBlock = DIMSDBLOCK*(hm/wXlen) + chart->sb;	//blok do odczytu
				f = hm%wXlen;
				
				if(mci_read_sect (strBlock,p_sd,DIMSDBLOCK)){
					
					sd->dat[f].d0 = g ; 
					/*
					sd->dat[f].d1 = g ;
					sd->dat[f].d2 = g ;
					sd->dat[f].d3 = g ;
					sd->dat[f].d4 = g ;
					sd->dat[f].d5 = g ;
					sd->dat[f].d6 = g ;
					sd->dat[f].d7 = g ;
					sd->dat[f].d8 = g ;
					sd->dat[f].e0 = g ;
					sd->dat[f].e1 = g ; */		
					
					if(mci_write_sect (strBlock,p_sd,DIMSDBLOCK)){
						
						UaPutS("\r\n Write OK ");
						num2uart(strBlock,5,0); 
						num2uart(f,5,0); 
						//data_logger_chart(sd,chart,1);
					}
					else { UaPutS("\r\n Write SD ERROR");	}
				}
				
				
			break;
			case 'z': //Write data raw
				
				UaPutK("\r\n Wykres start = ");	strBlock=UART_getNum()*DIMSDBLOCK+chart->sb;
				UaPutK("\r\n Ile Wykresow = ");	b=UART_getNum();
				UaPutK("\r\n liczba       = ");	g=UART_getNum();
				while(b--){
					
					if(mci_read_sect (strBlock,p_sd,DIMSDBLOCK)){
						
						for(f=0;f<wXlen;f++){
							sd->dat[f].d0 = g ; 
							sd->dat[f].d1 = g ;
							sd->dat[f].d2 = g ;
							sd->dat[f].d3 = g ;
							sd->dat[f].d4 = g ;
							sd->dat[f].d5 = g ;
							sd->dat[f].d6 = g ;
							sd->dat[f].d7 = g ;
							sd->dat[f].d8 = g ;
							sd->dat[f].e0 = g ;
							sd->dat[f].e1 = g ; 
						}
						
						if(mci_write_sect (strBlock,p_sd,DIMSDBLOCK)){
							UaPutC('.');	
						}
						else { UaPutS("\r\n Write SD ERROR");	}
						
					}
					strBlock += DIMSDBLOCK;
				}
				
			break;
			//===== Import danych przez UART ============================
			case 'i':
				UaPutK("\r\n Read from sector = ");
				strBlock=UART_getNum();
				UaPutK("\r\n Write to sector  = ");
				stB=UART_getNum();
				UaPutK("\r\n Ile?  					 = ");
				g=UART_getNum();
				UaPutK("\r\n");
				f=0;
				for(u16 z=0;z<g*8;z++){
					//UaPutS2("t");
					//UaPutS2(uint2str(strBlock,snum));
					//UaPutS2("\xd""1""\xd");
					//UaPutS2("t1000""\xd""1""\xd");
					//Delay_us(200);
					TIM_start(); 
					do{
						strcpy (sget,"t");
						strcat (sget, (const char*) uint2str(strBlock,snum) );
						strcat (sget,  "\xd""1""\xd");
						ws = strlen (sget);
						UaPutS2(sget);
						avg  = 0;
						//LED1 = 1;
						trg0 = SysTick->VAL;
						while (avg < (u32)(512+ws)){
							while(p_Fifo2->rct){
								UART_getChar2(&chr);
								if(avg>(u32)(ws-1)){
									*(p_sdb+avg-ws) = chr;
								}
								avg++;
							}
							if(STCLK_MS*60 < (trg0 - SysTick->VAL) ){ break; }
						}
					}while(avg-ws != 512);
					strBlock ++;
					for(u08 s=0;s<36;s++){
						sd->dat[f].d0 = sdb.dat[s].d0;
						sd->dat[f].d1 = sdb.dat[s].d1;
						sd->dat[f].d2 = sdb.dat[s].d2;
						sd->dat[f].d3 = sdb.dat[s].d3;
						f++;
						if(f==288){
							if(mci_write_sect (stB,p_sd,DIMSDBLOCK)){
								UaPutS("Write OK \r\n");
								stB += DIMSDBLOCK;
							}
							else { UaPutS("Write SD ERROR \r\n");	}
							f=0;
						}
					}
					//LED1=0;
					TIM_stop(&tim); 
					crc16_spi2((u16 *)p_sdb,256, &crc16 );
					if(avg==0){
					}
					//TIM_stop(&tim); 
					//LED1=0;
					hex2uart(crc16,4); 
					sint2uart(avg-ws); 
					sint2uart(ws); 
					sint2uart(tim/TIM_US); 
					sint2uart(stB-DIMSDBLOCK); 
					UaPutK("\r\n");
				}
				//strBlock=UART_getNum();
			break;
			case 's' :	
				UaPutK("\r\n Czy reset wykresu ?");		
				UART_getStr(snum);
				if(snum[0]=='t'){
					UaPutK("\r\n Reset wykresu");		
					chart->hm= 144;
					chart->vm= -100;
					chart->hs= 1;
					chart->vs= 1;
				}
				UaPutK("\r\n Czy ustawic czas ?");		
				UART_getStr(snum);
				if(snum[0]=='t'){
					UaPutK("\r\n Podaj rok [yyyy] = ");		Rtc.yer=UART_getNum();	// 1970..2106 
					UaPutK("\r\n Podaj mon [1..12]= ");		Rtc.mon=UART_getNum();	// 1..12 
					UaPutK("\r\n Podaj mdy [1..31]= ");		Rtc.mdy=UART_getNum();	// 1..31 
					UaPutK("\r\n Podaj hor [0..23]= ");		Rtc.hor=UART_getNum();	// 0..23 
					UaPutK("\r\n Podaj min [0..59]= ");		Rtc.min=UART_getNum();	// 0..59 
					UaPutK("\r\n Podaj sec [0..59]= ");		Rtc.sec=UART_getNum();	// 0..59 
					UaPutK("\r\n Podaj wdy [0..6] = ");		Rtc.wdy=UART_getNum();	// 0..6 (Niedziela..Sobota) 
					rtc_SetTime(&Rtc);
				}
				
			break;
			case 't':
				hm = RTC->CNTL + (RTC->CNTH<<16);
				UaPutK("\r\n UXT=");	sint2uart(hm); 
				Rtc.yer=2018;	// 1970..2106 
				Rtc.mon=2;	// 1..12 
				Rtc.mdy=15;	// 1..31 
				Rtc.hor=7;	// 0..23 
				Rtc.min=0;	// 0..59 
				Rtc.sec=0;	// 0..59 
				Rtc.wdy=4;	// 0..6 (Niedziela..Sobota) 
				rtc_time2unix ( &avg, &Rtc);
				//rtc_SetTime(&Rtc);
				
