pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
				TIM_stop(&tim);
				n1=tim/(TIM_MS*1000);
				TIM_start();
				
				/*
				UaPutS("\r\n dma="); 
				if((wXlen-c_dma1) == 0){
					sint2uart(wXlen-1); 
					sint2uart(dma_buf[wXlen-1]);
				}
				else{
					
					num2uart(c_dma1,4,0); 
					num2uart(wXlen-c_dma1-1,4,0); 
					for(u08 i=0;i<8;i++)
					num2uart(dma_buf[i],5,0);
					
				} */
				
				/*
				//if( STCLK_MS*1000 < (trg0 - SysTick->VAL) ){
				//	trg0 = SysTick->VAL;
				*/
				
				//Start_ADC1_J(nMES*nMES);
				///dma_buf[0+x*nMES]= ADC1->DR;
				
				//ADC1Init_J();
				//==============================================
				//Start_ADC1_DMA1_irq((wXmax-wXmin)*nMES);
				
				TFT_Fill(wXmin+(wXmax-wXmin)/2,wYmin-1,wXmin+(wXmax-wXmin)/2,wYmax+1,DGRAY);	// pionowa srodkowa
				TFT_Fill(wXmin-1,(wYmax-wYmin)/2,wXmax+1,(wYmax-wYmin)/2,DGRAY);						// pozioma srodkowa
				
				TFT_SetWindow(wXmin,wYmin,wXmax,wYmax);
				//UaPutS("\r\n");
				for(x=0;x<wXlen;x++){
					
					
					if( x>0 && x<15 ) {
						
						//hex2uart(yn[0],2); 
						//num2uart(yb[0],1,0); UaPutC(',');	num2uart(yn[0],1,0); UaPutC(' ');
						//hex2uart(dma_buf[x],2); 
						//hex2uart(idx,3); 
						
					}
					
					if(x>wXlen-15 && x<wXlen ) {
						
						//hex2uart(yn[0],2);  
						//hex2uart(dma_buf[x],2); 
						//hex2uart(idx,3); 
					}
					
					
					// Czyszczenie
					
					if( x>0 && x< wXlen-0 ){
						//UaPutS("\r\n ="); sint2uart(n); sint2uart(i); sint2uart(yp[i]); sint2uart(yb[i]); sint2uart(yn[i]); 
						for(i=0; i<nMES;i++){
							TFT_dy(wXmin+x-1, yb[i], yn[i],BLACK,WID);
						}
						
						
					}	
					// Rysowanie
					if(x>1){
						for(i=0; i<nMES;i++){
							TFT_dy(wXmin+x-2, yb[i], yn[i],ColCon[6+i],WID);
						}
					}
					
					
					//if(x == wXlen-1) {	idx=(wXlen+0-c_dma1)*nMES; }	// ostatni punkt
					//if(x<(wXlen-c_dma1))	idx=(wXlen-c_dma1-1-x)*nMES; 
					//else 									idx=(wXlen-					x)*nMES; 
					
					if(x<cnt_dma)	idx=(0    +cnt_dma-x-1)*nMES; 
					else 					idx=(wXlen+cnt_dma-x-1)*nMES; 
					
					
					for(i=0;i<nMES;i++){
						r_dma_buf =(dma_buf[i+idx]-rz[i])*mn[i]/dl[i]; 
						yb[i]=yn[i];
						
						if(r_dma_buf < (wYmax-wYmin) ){
						yn[i]=wYmin + (r_dma_buf);	}
						else {	yn[i]=wYmax-wYmin;		}
						
					}
					
					if(x==wXlen-2){
						for(i=0; i<nMES;i++){
							val[i]=dma_buf[i+idx];
						}
					}
				}
			}
			
			
			if( STCLK_MS*500 < (trg1 - SysTick->VAL) ){
				trg1 = SysTick->VAL;
				//u16 o=4*60;
				//UaPutS("\r\n ADC1= ");
				//num2uart(tim/TIM_US,8, 3); 
				//TFT_txt(int2str(x,str,1,0),0,0, YELLOW); // œrodek skali 	x
				//TFT_txt(int2str(x,str,2,0),0,10, YELLOW); // œrodek skali 	x
				//TFT_txt(int2str(vAD[0],str,3,0),0,229-12*0,ColCon[6]);
				//TFT_txt(int2str(vAD[1],str,3,0),0,229-12*1,ColCon[6]);
				
				
				TFT_txt(int2str(val[0],str,4,0),30,229-12*0,WHITE);
				//TFT_txt(int2str(val[1],str,4,0),70,229-12*0,YELLOW);
				TFT_txt(int2str(tim/TIM_MS,str,5,0),110,229-12*0,ColCon[6]);
			}
			
			
			
			if(p_Fifo1->rct){	// Wywolanie interfejsu szeregowego gdy odebrano znak
				UART_getChar(&chr);
				if(chr=='q'){
					UaPutS("\r\n TIM4->PSC/ARR="); 	sint2uart(TIM4->PSC);	UaPutC('/'); c_num=UART_getNum();
					if(c_num){ 
						BKP->DR41=c_num; TIM4->PSC=BKP->DR41;
						BKP->DR42=c_num; TIM4->ARR=BKP->DR42;
					}
					
					
					//UaPutS("\r\n DMA1->ISR="); 	sint2uart(DMA1->ISR); 
					//UaPutS("\r\n DMA1->CCR="); 	sint2uart(DMA1_Channel1->CCR); 
					UaPutS("\r\n");
					chr='b';
				}
				
				if(chr=='b'){	
					
					TFT_Clear(BLACK);
					TFT_Fill(wXmin-1,wYmin-1,wXmin-1,wYmax+1,DGRAY);	// pionowa lewa
				}
			}
			/*
			if(f7_dma1){
				
				//sint2uart(DMA1_Channel1->CNDTR); 
				LED2   ^= 1;
				f7_dma1 = 0;
				f8_dma1  = 1;
				trg2   = SysTick->VAL;
			}
			
			if( f8_dma1 && STCLK_MS*10 < (trg2 - SysTick->VAL) ){
				LED2  ^= 1;
				f8_dma1 = 0;
			}
			*/
			if(f3_rtc_1sec){	// Aktualizacja zegara
				f3_rtc_1sec = 0;
				
				rtc_GetTime(0, &Rtc);
				CopyClock(tbuf,&Rtc); TFT_txt(tbuf,180, 229,YELLOW);
				//if((Rtc.sec%2)==0){	f11_rtc_2sec = 1;	}
				//if((Rtc.sec%5)==0){	f6_rtc_5sec  = 1;	}
				p=(p+1)%(wYmax-wYmin);
				
			}
		}
	}
//=========================================================================================================
u32  qtouch_mesaure(void){
		u32 i=0;
		PE2_o = 0;
		while(PE4_i == 1);
		Delay_us(2);
		PE2_o = 1;
		do{i++;} while (PE4_i == 0);
		PE2_o = 0;
		return i;
	}
	
void qtouch(void){
		u32 qt=0;
		GPIOE->CRL = (GPIOE->CRL & 0xfff0f0ff) | 0x00040300;	
		while(1){
			if(STCLK_MS*500 < (trg0 - SysTick->VAL) ){
				trg0 = SysTick->VAL;
				qt = qtouch_mesaure();
				UaPutS("\r\n QT =");		sint2uart(qt);
			}
		}
	}

#ifdef NOTUSE
void http_client(void){
		
		char tbuf[20]={"0000-00-00 00:00:00"};
		f5_eth = 0;
		u08 switcH,reg_adr=0;
		reg_adr=reg_adr;
		
		RegisterEthEventCallback(zapytanie_http);	
		
		rtc_GetTime(1,&Rtc);
		CopyClock(tbuf,&Rtc);
		TFT_txt(tbuf,180, 229,YELLOW);
		
		init_simple_client();
		flag_6 = 1;
		
		//p_Fifo1->rct=1;	p_Fifo1->rwi=1;	p_Fifo1->rbuf[0]='s';
		//TIM_start(); 
		//spi1_rw(0xff);
		//Delay_us(100);
		//TIM_stop(&tim); 
		//UaPutK("\r\n Start loop...");
		//sint2uart(tim/TIM_US);
		
		while(1){
			if(flag_6) 	eth_event();
			
			
			if(f4_enc28){
				f4_enc28 = 0;
				//plen = enc28j60PacketReceive(BUFFER_SIZE, buf);
				//plen=packetloop_arp_icmp_tcp(buf,enc28j60PacketReceive(BUFFER_SIZE, buf));
				//simple_server();
				UaPutC('.');
				//UaPutK("\r\n plen=");
				//sint2uart(plen);
			}
			
			if(STCLK_MS*1000 < (trg0 - SysTick->VAL) ){
				trg0 = SysTick->VAL;
				f5_eth = 1;
				//LED1 ^= 1;
				
			}
			
			if(f3_rtc_1sec==1){
				rtc_GetTime(1, &Rtc);
				CopyClock(tbuf,&Rtc);
				TFT_txt(tbuf,180, 229,YELLOW);
				f3_rtc_1sec=0;
			}
			
			if(p_Fifo1->rct){
				UART_getChar((char*)&switcH);
				
