pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
				switch (switcH)	{
					case 'r':
						UaPutK("\r\n PhyRegister addr = 0x");
						reg_adr=UART_getHex();
						UaPutK("\r\n Value = 0x");
						//hex2uart( enc28j60PhyReadH(reg_adr),4);
					break ;
					case 'i':
						UaPutK("\r\n Init client");
						init_simple_client();
					break ;
					case 's':
						UaPutK("\r\n Start client http");
						flag_6 = 1;
						UaPutK("\r\n enc28j60Revision = ");
					break ;
				}
				
			}
			
		}
		
	}

void ENC28J60_Tool(void){
		// 8,388,608 bytes, 32768 pages(256 bytes)
		
		u08 switcH,dinit,reg_adr,i2c_dat;
		
		char tbuf[20]={"0000-00-00 00:00:00"};
		//u16 crc16,crc_dat;
		MMCFG mmcfg;
		//cdata = (u16*) buffer;
		p_Fifo1->rct=1;	p_Fifo1->rwi=1;	p_Fifo1->rbuf[0]='i';
		
		f4_enc28 = 0;
		LED2=0;
		I2C2_init();
		
		//rtc_SetTime(&Rtc);
		rtc_GetTime(1,&Rtc);
		CopyClock(tbuf,&Rtc);
		TFT_txt(tbuf,180, 229,YELLOW);
		
		for(;;)
		{
			//Menu1();
			UaPutK("\n\r\n======= ENC28J60 Tool ============================\r\n");
			UaPutK(" s - Stat Reg  r - Read  memory  e - Erase page     \r\n");
			UaPutK(" c - CRC Sum   w - Write memory  E - Erase All     \r\n");
			UaPutK("==================================================\r\n > ");
			
			while(!p_Fifo1->rct){
				if(f4_enc28){
					f4_enc28 = 0;
					//plen = enc28j60PacketReceive(BUFFER_SIZE, buf);
					//plen=packetloop_arp_icmp_tcp(buf,enc28j60PacketReceive(BUFFER_SIZE, buf));
					//simple_server();
					//UaPutC('.');
					//UaPutK("\r\n");
					
				}
			}
			//if(p_Fifo1->rct){	// Wywolanie interfejsu szeregowego gdy odebrano znak
			
			UART_getChar((char*)&switcH);
			//UaPutC('\f');
			UaPutK("\r\n ");
				switch (switcH)	{
				//========== Init Card SD/MMC ==================================
				case 's':
					
					dinit=mci_init();
					if(dinit){
						if(	mci_read_config (&mmcfg)){
							UaPutK("\r\nSD Card ser_num    = "); uint2uart(mmcfg.sernum);
							UaPutK("\r\nSD Card block_num  = "); uint2uart(mmcfg.blocknr);
							UaPutK("\r\nSD Card read_blen  = "); uint2uart(mmcfg.read_blen);
							UaPutK("\r\nSD Card write_blen = "); uint2uart(mmcfg.write_blen);
						}
					} else UaPutK("\r\nSD Card Init ERROR ");
					
				break;
				case 'i':
					//init_simple_client();
					//simple_server_client();
					
				break ;
				case 'r':
					UaPutK("\r\n PhyRegister addr = 0x");
					reg_adr=UART_getHex();
					UaPutK("\r\n Value = 0x");
					//hex2uart( enc28j60PhyRead(reg_adr),4);
				break ;
				case 'w':
					//UaPutK("\r\n Start simple server ... ");
					//UaPutK("\r\n sizeof  ( un_int)= ");		uint2uart(sizeof(u16));
					UaPutK("\r\n simple_server_client() ");
					//simple_server_client();
					//rev = enc28j60getrev();
					//enc28j60read();
				break ;
				case 't':
					UaPutK("\r\n i2c addr = 0x");
					reg_adr=UART_getHex();
					UaPutK("\r\n Value = 0x");
					
					while(1){
						if(STCLK_MS*1000 < (trg0 - SysTick->VAL) ){
							trg0 = SysTick->VAL;
							
							i2c2_read( DS3231_ADDR,reg_adr, &i2c_dat, 1 );
							hex2uart( i2c_dat,2);
							
							if(p_Fifo1->rct) break;
						}
						if(f4_enc28){
							f4_enc28 = 0;
							//plen = enc28j60PacketReceive(BUFFER_SIZE, buf);
							//simple_server();
						}
					}
					
				break ;
			}
			
		}
	}
#endif
//=========================================================================================================
#ifdef NOTUSE
void Radio(void){
	u08 txBUF[10]={1,2,3,4,5,4,3,2,1,0};
	u08 znak;
	u16 n=0;

	nRF24L01_Init();
	UaPutS("\r\n Radio Init ");
	TX_Mode();
	for(;;){
		nRF24_tx(txBUF);
		UaPutS("\r\n TX->nRF24L01 ");
		sint2uart(n++);
		Delay_ms(2000);

	}

}
void Test_avg(void){
	static u16 y[320],a[320],ys;
	u32 tim=0;
	//static u16 b[320];
	//static volatile uint32_t * const jdrs[] = {&ADC1->JDR1, &ADC1->JDR2, &ADC1->JDR3, &ADC1->JDR4};
#define DT 7
	adc1_init_injected(1, 1);
	for(;;){

		if( STCLK_MS*300 < (trg0 - SysTick->VAL) ){
			trg0 = SysTick->VAL;
			TIM_start();
			for(u16 n=0;n<320;n++){

				/*
					if(n==0){
						y[0] = y[1];
					}
					else{
						TFT_dy(n-1, y[n-2], y[n-1], BLACK,0);	
						TFT_dy(n-1, a1		,		 a2 , BLACK,1);	
						a1=a2;
					}
				 */
				// Clear
				if(n>0){
					TFT_dy( n-1, ys, y[n], BLACK, 1);
					//TFT_dy( n-1, a[n-1], a[n],   BLUE, 1);
				}
				ys=y[n];

				//y[n] = (adc_get_injected(1))/16;
				ADC1_CR2_JSWSTART_bb = 1;
				while (ADC1_SR_JEOC_bb == 0);
				//ADC1_SR_JEOC_bb = 0;
				y[n]= ((ADC1->JDR1-36)/4-400)  ;

				a[n] = a[n] * DT;
				a[n] = a[n] + y[n];
				a[n] = a[n] / (DT+1);
				//a[n] = a[n] * DT;
				//a[n] = a[n] + y[n];
				//a[n] = a[n] / (DT+1);

				if(n>0){
					TFT_dy( n-1, y[n-1], y[n], YELLOW, 1);
					//TFT_dy( n-1, a[n-1], a[n],   BLUE, 1);
				}

				//Delay_us(500);
			}
			TIM_stop(&tim);
		}

		if( STCLK_MS*300 < (trg1 - SysTick->VAL) ){
			trg1 = SysTick->VAL;

			//UaPutS("\r\n" ); 			uint2uart(y[n]);
			UaPutS("\r\n Time [us] = " ); 	num2uart(tim/TIM_US, 6,0);
		}
		//TFT_Clear(BLACK);

	}
}
//===========================================================================
void EN25QH64_Tool(void){
		// 8,388,608 bytes, 32768 pages(256 bytes)
		
		u08 switcH,dinit,data,sr=0;
		u16 ID,crc16,crc_dat;
		//MMCFG mmcfg;
		u32 addr,to_addr,tim,tout;
		static u08 buffer[512];
		u16 * cdata;
		//cdata = (u16*) buffer;
		//p_Fifo1->rct=1;	p_Fifo1->rwi=1;	p_Fifo1->rbuf[0]='i';
		SPI2_init();
		crc16_spi1_init();
		disk_init(0);
		//crc16_spi3_init();
		for(;;)
		{
			//Menu1();
			UaPutK("\n\r\n======= EN25QH64 Tool ============================\r\n");
			UaPutK(" s - Stat Reg  r - Read  memory  e - Erase page     \r\n");
			UaPutK(" c - CRC Sum   w - Write memory  E - Erase All     \r\n");
			UaPutK("==================================================\r\n > ");
			
			while(!p_Fifo1->rct);
			//if(p_Fifo1->rct){	// Wywolanie interfejsu szeregowego gdy odebrano znak
			
			UART_getChar((char*)&switcH);
			//UaPutC('\f');
			UaPutK("\r\n ");
				switch (switcH)	{
				//========== Init Card SD/MMC ==================================
				case 'i':
					/*
					dinit=mci_init();
					if(dinit){
						if(	mci_read_config (&mmcfg)){
							UaPutK("\r\nSD Card ser_num    = "); uint2uart(mmcfg.sernum);
							UaPutK("\r\nSD Card block_num  = "); uint2uart(mmcfg.blocknr);
							UaPutK("\r\nSD Card read_blen  = "); uint2uart(mmcfg.read_blen);
							UaPutK("\r\nSD Card write_blen = "); uint2uart(mmcfg.write_blen);
						}
					} else UaPutK("\r\nSD Card Init ERROR ");
					*/
					dinit=disk_init(0);
					if(dinit){
					UaPutK("\r\nSD Card Init = "); sint2uart(CardType);
					} else UaPutK("\r\nSD Card Init ERROR ");
				break;
				//========== Card Info =========================================
				case 's':
						SPI2CS = 0; 
						spi2_rw(0x05);						// Read status register
						UaPutK("  Status Register = 0x");	hex2uart(spi2_rw(0x00),2);
						SPI2CS = 1;			
						
				break;
				case 'd':
					ID=0;
					UaPutK("read ID");
					SPI2CS = 0;
					spi2_rw( 0x5a);
					spi2_rw( 0x00);
					spi2_rw( 0x00);
					spi2_rw( 0x00);
					spi2_rw( 0x00);
					//spi2_rw( 0xff);
					ID=spi2_rw( 0x00); uint2uart(ID);
					ID=spi2_rw( 0x00); uint2uart(ID);
					ID=spi2_rw( 0x00); uint2uart(ID);
					ID=spi2_rw( 0x00); uint2uart(ID);
					ID=spi2_rw( 0x00); uint2uart(ID);
					ID=spi2_rw( 0x00); uint2uart(ID);
					ID=spi2_rw( 0x00); uint2uart(ID);
					ID=spi2_rw( 0x00); uint2uart(ID);
					
					SPI2CS = 1;
					UaPutK("\r\nID = "); uint2uart(ID);
					
				break;
				case 'c':	// ==================== Check CRC memory ======================
					UaPutK("Read memory from addr = 0x");
					addr=UART_getHex();
					UaPutK("\r\n Read memory to   addr = 0x");
					to_addr=UART_getHex();
					UaPutK("\r\n ");
					
