pakosep/sepako/stm32f1_blue/doc/main_sleep_flash_ok.c
			UaPutK("\r\n Find Sector = 0x");	hex2uart(strBlock, 8);
			UaPutK("\r\n     lenBlock= ");		sint2uart(lenBlock);
			break;
			//========== Testing =======================================
		case 't':
			UaPutK("Read sector");
			UaPutK("\r\n sectorNumber = 0x");
			//strBlock = UART_getNum((char *)uaBuf);
			strBlock=UART_getHex();
			UaPutK("\r\n sectorNumber = 0x");		hex2uart(strBlock, 8);
			while(strBlock <  31116288 ){
				TIM_start();
				//i=SD_readSingleBlock(buffer,strBlock);
				if( mci_read_sect (strBlock,buffer,1*16)) {
					crc16_spi2((u16*)buffer,256*16, &crc );
					if( crc ) {
						UaPutK("\r\n Block = ");	hex2uart(strBlock,8); hex2uart(crc,4);
					}
					strBlock+=1*16;
					TIM_stop(&tim);
				} else UaPutK("\r\n Read Error ");
				if(p_Fifo1->rct) break;
			}
			//UaPutK(" time = ");	uint2uart(tim/TIM_US);
			UaPutK("\r\n Block = ");	hex2uart(strBlock,8); hex2uart(crc,4);
			break;
			//========== Testing =======================================
		case 'q':
			if(1) {
				//if(disk_ioctl(0,GET_SD_CMD9 ,buffer) == RES_OK) {
				//if(disk_ioctl(0,GET_SD_STATUS ,buffer) == RES_OK) {
				UaPutK("\r\n SD_Status \r\n ");
				hex2uart(0,4);
				for(u08 k=0;k<8;k++){ hex2uart(k, 2);	}
				UaPutK("\r\n\n ");
				for(u32 i=0;i<64;i+=8){
					unt2uart(i*8,4);	UaPutC(' ');
					for(u08 k=0;k<8;k++){
						hex2uart(buffer[k+i], 2);
					}
					UaPutS("  ");
					for(u08 k=0;k<8;k++){
						if ( buffer[k+i]<0x20 || buffer[k+i]>127 ) UaPutC('.');
						else UaPutC(buffer[k+i]);
					}
					UaPutS("\r\n ");
				}
			} else UaPutK("\r\n Read Error \r\n ");
			break;
		case 'x':
			UaPutK("Testing ...");
			//LED1 ^= 1;
			break;
			//========== Default ===========================================
		default :
			UaPutK("Unkr_dma_buf Command !");
			break;
		}
	}
}
#ifdef NOTUSE
		void quicksort(int tablica[], int x, int y){
			int i,j,v,temp;
			i=x;
			j=y;
			v=tablica[div(x+y,2).quot];
			do
			{
				while (tablica[i]<v) i++;
				while (v<tablica[j]) j--;
				if (i<=j)
				{
					temp=tablica[i];
					tablica[i]=tablica[j];
					tablica[j]=temp;
					i++;
					j--;
				}
			}
			while (i<=j);
			if (x<j) quicksort(tablica,x,j);
			if (i<y) quicksort(tablica,i,y);
		}

		void bublesort(u16* arr, uint8_t len)	{
			uint8_t i,j;
			int tmp;
			for(i=0;i<(len-1);i++)
				for(j=0;j<(len-(i+1));j++)
					if(arr[j] > arr[j + 1]) {
						tmp = arr[j];
						arr[j] = arr[j + 1];
						arr[j + 1] = tmp;
					}
		}

		void bubbleSort(int* array, int size) {
			int swapped;
			int i;
			for (i = 1; i < size; i++)
			{
				swapped = 0;    //this flag is to check if the array is already sorted
				int j;
				for(j = 0; j < size - i; j++)
				{
					if(array[j] > array[j+1])
					{
						int temp = array[j];
						array[j] = array[j+1];
						array[j+1] = temp;
						swapped = 1;
					}
				}
				if(!swapped){
					break; //if it is sorted then stop
				}
			}
		}
		
		/*
		void shellsort(long *a, long n){ 
		// Sedgewick-Incerpi sequence  
				long step[16] = {1, 3, 7, 21, 48, 112, 336, 861, 1968, 4592, 13776, 33936, 86961, 
				198768, 463792, 1391376}; 
				long i, j, k, s, t; 
				k = (n < 256) ? 6 : 15; 
				do { for (s=step[k], i=s-1; i < n; i++) 
				{ t = a[i]; for (j=i; j >= s && t > a[j-s]; a[j] = a[j-s], j -= s); a[j] = t; } } 
				while (k–);
			} */

		void lsort(long *intArray, long SIZE){ 
			int i,j;
			for (i=0;i<(SIZE-1);i++)
			{ for(j=i;j<(SIZE-1);j++) 
			{ int tmp = intArray[j]; if( intArray[j+1] > intArray[j]) { intArray[j] = intArray[j+1]; intArray[j+1] = tmp; } }}
		}

		void TFT_VLine(u16 x1){
			TFT_REG = 0x004e;
			TFT_RAM = 239-239;
			TFT_REG = 0x004f;
			TFT_RAM = 319-x1;
			TFT_REG = R34;
			for (u08 i=0;i<240;i++)	TFT_RAM = BLACK;
		}
		void Intro1(void){
			char znak;
			u16 xCN=0;
			U1buf_ptr = u1buf;
			while(1)
			{
				//UaPutC('\f');
				UaPutS("\r\n Liczba  =");
				uint2uart(xCN);
				UaPutS("\r\n Adres = 0x");

				Menu();
				//LED1 = 1;
				UART_getChar(&znak);
				//while(flg_1 == 0);
				//FLG &= ~1;
				//while((FLG & 1)==0);
				//FLG &= ~1;
				//flg_1 = 0;
				UaPutC('\f');
				//switch (u1buf[0])	{
				switch (znak)			{
				//==========  ================================
				case 'r':
					//UaPutS("\r\n getSetNextCluster Get, Set or Write ? ");
					UaPutS("\r\n Pressed key r ");
					//strBlock = UART_getNum((char *)u2buf);
					//znak = UART_getChar();
					if(znak == 'g'){	// Read next clusters
						UaPutS("\r\n Start Cluster = ");
						//test = str2hex((char *)u1buf);
					}
					break;
					//==========  ================================
				case 'w':
					UaPutS("\r\n Pressed key w ");
					break;
					//==========  ================================
				default:
					UaPutS("\r\n Pressed other key ");
					break;
				}
				xCN++;
			}
		}
		
		void Mem2MemDMAInit(void *dst_buf, void *src_buf ){
			//DMA Configuration
			uint32_t CCR_reg = 0;
			RCC->AHBENR   			|= RCC_AHBENR_DMA2EN;	// enable clock for DMA2
			DMA2_Channel1->CCR 	= 0;										//Disable channel
			DMA2_Channel1->CMAR = (uint32_t)dst_buf;	 	//Destination address:
			DMA2_Channel1->CPAR = (uint32_t)src_buf;		//Source address:
			//DMA2_Channel1->CNDTR = sizeof(dst_buf);			//Buffor size :
			DMA2_Channel1->CNDTR = 320/2;		//Buffor size :
			CCR_reg |=  DMA_CCR1_MEM2MEM;	//Memory to memory mode
			CCR_reg |=  DMA_CCR1_PL;			//Priorytet high
			//CCR_reg |=  DMA_CCR1_MSIZE_1 | DMA_CCR1_PSIZE_1;	// 32bit/32bit
			CCR_reg |=  DMA_CCR1_MSIZE_0 | DMA_CCR1_PSIZE_0;	// 16bit/16bit
			CCR_reg |=  DMA_CCR1_MINC;	//Increment memory address enabled
			CCR_reg |=  DMA_CCR1_PINC;	//Increment peripheral address enabled
			CCR_reg &= ~DMA_CCR1_CIRC;	//Mode Circular mode disabled
			CCR_reg &= ~DMA_CCR1_DIR;		//Dir Read from peripheral
			//CCR_reg |=  DMA_CCR1_TCIE;	//Transfer complete interrupt enable
			DMA2_Channel1->CCR =  CCR_reg;
			DMA2_Channel1->CCR |= DMA_CCR1_EN;
		}
		void Mem2MemDMA(void *src_buf, u32 offset ){
			//DMA Configuration
			DMA2_Channel1->CCR &= ~DMA_CCR1_EN;
			DMA2_Channel1->CNDTR = 320;			//Buffor size :
			DMA2_Channel1->CPAR = (uint32_t)src_buf + offset*2;		//Source address:
			DMA2_Channel1->CCR |= DMA_CCR1_EN;
		}
		void ReadNRF(void)		{
			u08 reg = 7,data;
			//char tbuf[16];
			UaPutS("\r\n Input   = 0x");
			reg = str2hex((char *)u1buf);
			if(reg == 0xFA) data = GPIOA->IDR & 0xff;
			else						nRF24_readBuf(reg, &data, 1);

